[
  {
    "post_id": "9841da2d-8cc2-411b-b300-e78f152dc379",
    "post_title": "Possible character them probably cut without at pattern.",
    "author_id": "8b5e1396-deaf-499a-88a8-3b28dc95ba02",
    "user_id": "tranrandy",
    "comments": [
      {
        "comment_id": "cee68f90-7ffb-4b55-8f09-ba9ef7938657",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Why are foreigners claiming primary residence benefits allowed to pass on the honour system?\n\nCan a foreigner with temporary Canadian status claim a property in Canada as a principle residence?\n\nWhy does a foreigner with minimum 35% down payment get a mortgage from a Canadian financial institution without having to verify income? Are money laundering fears passé?"
      },
      {
        "comment_id": "c6c42227-5146-42e3-8955-fad3ae2a9fb6",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "The one in Waikiki is a disaster. Went there once and will never go again. Asked for well-done and the filet mignon was almost raw. Told the waitress to have the cook try again and do not give us the same piece of meat back since, once it's cut, all the juices come out and the steak is dry.\nShe fought with us for twenty minutes and refused to do it. I could go on with all the details but you get the point. This place is only for tourists who won't be coming back to the islands since it's doubtful they ever get repeat customers. Stay away!!!"
      },
      {
        "comment_id": "562b3210-1a1f-4ac4-9f0b-8cd9e5ba2bcb",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Resigning is a positive career move for Spicer, but I do not know how he can ever honestly explain why he chose to work for such a rapacious person."
      },
      {
        "comment_id": "8f59f432-ee9f-44da-a607-d183c6b69f1a",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "An 18 year payback is pretty crappy. The units will be worn out by then."
      },
      {
        "comment_id": "af4e0416-3ef0-4cb5-8711-0b8e0614db07",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Is this going to be the Globe and Mail versus the police services of Canada ?"
      },
      {
        "comment_id": "28661d05-fad5-467d-a493-82095bb044a7",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Dehumanizing one's opponents has always been an important element o tyranny.\n\nI'll admit to some surprise that an academic is not calling for better education in rhetoric and argument analysis in high-schools; but then it appears that like so many others, he has been panicked by a pathetically small gathering of violent wing-nuts in Charlottesville."
      },
      {
        "comment_id": "2574dc41-4bcc-4a79-8bf1-a3b8c8baabdd",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "'Our efforts will be to continue to sew the seeds' To the editor, perhaps you meant 'sow the seeds'"
      },
      {
        "comment_id": "d087adaf-98d3-438d-b7fe-374d90bd92bf",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "He's made Sarah look better each day!"
      },
      {
        "comment_id": "f912d90c-c30d-4eeb-bc05-3b99ed588fd4",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "The real haters are those that characterize former Reform or Tory supporters as haters."
      },
      {
        "comment_id": "66f5f83e-9840-4978-b3d2-0f7292cb6f32",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Dems ARE the roadrunner....mbeep, mbeep!"
      },
      {
        "comment_id": "de06b84e-f188-4a81-be03-ed1545ce2f54",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "It's about time.  Sweden has a lot of problems with dishonesty and authoritarian methods in its thoght-controlling government.  They just barred 14000 innocent people, including parliamentarins and academics, from the government Twitter feed, calling them all troublemakers of one kind or another."
      },
      {
        "comment_id": "0edcc380-7d63-4cf2-8161-03bc9df44cd1",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "\"“Let all the world know that this economy kills,” the bishop said.\"  If this economy is horrible, why is he encouraging illegals to come here?  Why is he complicit and aiding and abetting in their crime?  The Pope decries the US economy, yet chastises anyone who opposes illegal immigration in the US.  Why does the Pope encourage illegal immigrants to come to the place with such a corruptible economy that kills?"
      },
      {
        "comment_id": "ca0914c9-0fcc-4715-9406-e3e923cc7bed",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "STEM?"
      },
      {
        "comment_id": "3fadc734-a229-4243-846d-f56768892f9a",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Pakistan is much better than this article portrays both economically and politically. They are far from going down the theocratic path like Iran or even Afghanistan. Yes they have problems, and they do have undeveloped areas with similar problems to Afghanistan, but it is a very small percentage of the population.  There is an rivalry with India, but in truth Pakistan has historically aligned more with the US than India. Finally, we cannot solve their problems, only they can. We can aid them in that, but the initiative and main actions have to be their own."
      },
      {
        "comment_id": "b8e18309-7dfb-4cdc-9cf8-fa1249f9e191",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "That's it?  That was your \"list\"?  You could have just turned on any talk radio show to have those repeated to you 50 times per hour. I hope no one paid you for this drivel.\nOh, and one more note: none of that stuff you mentioned is a felony for anyone not named Trump."
      },
      {
        "comment_id": "3f4aa065-b8fe-4ffb-b549-c0739d2dc9b6",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "The sea: ever a great teacher!"
      },
      {
        "comment_id": "4d101f9b-a4d6-42a9-ba88-ce8c211c3539",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "The one thing Trump can't stand is people laughing at him..."
      },
      {
        "comment_id": "9d5840aa-4909-4bde-96e5-c0461b2eba2d",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Cemeteries in general are a waste of land.  This is not an issue in big cities.  You get cremated as there is no place to plant you underground.  I like it.  Better yet, I hear one's body can be composted and actually do some good.  Compost me and put a tree on top :)"
      }
    ]
  },
  {
    "post_id": "d7b5765f-85eb-486d-93f0-27d9a9303ff1",
    "post_title": "Stage site listen might interest baby itself free day.",
    "author_id": "f47b29e9-388a-48ed-8a43-4f9fc680ccd8",
    "user_id": "timothy01",
    "comments": [
      {
        "comment_id": "6f45e4de-4d7f-4254-bf94-2c9aecd102fa",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "A bit defensive? You vote for someone not on the ballot and want the moral high ground? Don't think so."
      },
      {
        "comment_id": "b2f69e0f-f769-4354-9934-e16eb38ff0de",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "It didn't take long for this left wing rag, the Globe and Mail, to lay blame on Donald Trump...get over it. Guns and the NRA have been around a lot longer than Trump has been President.  Why does everything have to be about or because of Trump?"
      },
      {
        "comment_id": "bccec148-7931-4e44-bb7f-bc683dcaf3c6",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "Plus he did serve good food."
      },
      {
        "comment_id": "9ade21c4-bb83-45bd-92d8-85a12c011a5e",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "Actually Tom, I think it is about property too.  While it is sad that those people died in the Marco Polo fire, look at all the units that were damaged.  Property damage I am sure will be more than bodily injury althouth some would say it is impossible to put a value on life.  Then there is the time element loss which will also be substantial.  \n\nBut you are right.  Helmets should be required.  I don't believe they cannort hear anything with a helmet on.  Get hearing aids too them.  lol"
      },
      {
        "comment_id": "d890b148-38db-467f-8c5b-7791072f50f0",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "I smell a lawsuit against the state for taking the funds.\nThink about it we were paid last year on the average of the past 3 years so wouldn't they have to continue to pay use based on the last three years this year and next year until the three year rule is over? and would they have to put it to a vote to change the PDF structure?"
      },
      {
        "comment_id": "41ea541d-8dee-4257-aa75-3fcbf96237aa",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "Yes, colonial attitude.\n\n1st, denial of history.  I tried to point out that the xenophobia you dislike is a recent phenomenon.  Cook was welcomed with open arms because Hawaiians and Polynesians generally were voyagers par excellence.  They celebrated voyagers and made them feel at home when they made landfall.  How else could their ancestors have settled every landmass over 1/3 of the globe?  Xenophobia would have been counter-productive to this enterprise, don't you think?  Kamehameha actively sought alliance with King George of England, and he and others spoke of themselves as men of Brittanee.  Through much of the 19th century Hawai`i had one of the greatest rates of literacy in the world, and the local newspapers were filled with stories about goings-on around the world.  These were some of the least xenophobic people in the world for a long time.\n\n(continued)"
      },
      {
        "comment_id": "bfc4cb0c-06a7-46f8-b993-a996fb155bb3",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "What's with all the snide comments by so many posters here?  It's really the same as it would be with a suspected male perpetrator and a female victim."
      },
      {
        "comment_id": "926bd835-73d4-4d7f-95f4-f30217c13405",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "stop using common sense to make your indisputable point....... the cops need more and more..... theyre heros"
      },
      {
        "comment_id": "98173051-5145-4881-96de-986e60b7c62c",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "\"While K-12 teachers and others are pushing for the measure, the Oregon League of Women Voters has warned that if the Legislature cannot find new money to pay for Measure 99, the measure “would likely reduce funding for other education programs.”\n\nAccording to my Voter's Pamphlet Measure 99 is the Outdoor School Education Fund.\n\nEither you didn't proof your article and this is a typo or you are attempting to mix two different measures together for some other reason."
      },
      {
        "comment_id": "24459fab-e1b8-4264-aca1-9d8f2b52fed4",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "The \"delete\" button is to allow you to delete your own posts. You are seeing a conspiracy where none exists, which is typical of your comments on here."
      },
      {
        "comment_id": "dfe65b2a-cf27-476e-bb66-1f018b10c242",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Why?  It has absolutely nothing to do with the supposed story of Brit teachers afraid to teach the Blair/Bush  version of 9/11 to kids.\n\nIt about Muslims and war though so, likely you think you be on topic.  Booga booga."
      },
      {
        "comment_id": "67762be4-e361-4d4e-b7ae-b122eddae451",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "\"Crews removed Baltimore’s Confederate statues early Wednesday, days after the deadly unrest in Charlottesville instigated by white nationalists rallying to defend a Confederate monument.\" - This opening is statement highly inflammatory and false...it's white supremacist. There's a difference between supremacist and nationalist. I can be a nationalist and not be racist. The label of \"White Nationalist\" is an attempt to combine \"White Supremacists\" and the \"Nationalist\" movement credited to Donald Trump. Very biased and shows how the DP swings to the left."
      },
      {
        "comment_id": "437eadf6-0d26-4ded-86dc-10bc417a7a08",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "I think you're way off in your Cheers analogy. This essay was clearly written by Coach."
      },
      {
        "comment_id": "fe21442b-4f40-4a02-9d8f-f063c6fa731d",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Take a lesson, Alaska! Take a lesson, Feds!"
      },
      {
        "comment_id": "b079a2cb-a8e2-451b-9a7a-551ae2890083",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Every single American should contribute to their country. No freebies for ANYONE!"
      },
      {
        "comment_id": "828bf81b-5915-4afb-b5a2-3c4fa196f531",
        "author_id": "2ee4f0c8-ecea-48bf-8475-05ec223e951a",
        "user_id": "vwilkinson",
        "content": "Did you even read the article?\n\n<<One reason investors don’t seek out responsible investments is the “performance myth,” says Mr. Lanz, “which suggests that there is a performance penalty for being a responsible investor.”\n\nHe cites Canadian and international studies showing that, on average, responsible investments perform “just as well if not better than traditional investments over the long term.”>>"
      },
      {
        "comment_id": "1372d92c-f51e-4660-a59d-b45c0ad6b42a",
        "author_id": "2ee4f0c8-ecea-48bf-8475-05ec223e951a",
        "user_id": "vwilkinson",
        "content": "Sorry, you mean Victoria. No raw sewage here. Go to www.wildernesstravels.org it shows the pristine beaches and clear water etc. Then you may see what we mean."
      },
      {
        "comment_id": "7b691abb-35c2-4ff4-9a0e-cc58da8875db",
        "author_id": "2ee4f0c8-ecea-48bf-8475-05ec223e951a",
        "user_id": "vwilkinson",
        "content": "It is not so much that he is a dunce, it is more a reflection of his values and ethical\nstandards. When you go to Punahou, you are expected to use your \"connections\"\nto advance your self interest and or take care of your \"friends\".  Kind of like the old boy\nnetwork system."
      },
      {
        "comment_id": "4f3c3ac9-74a4-4857-8b20-5d04b17d1ab1",
        "author_id": "2ee4f0c8-ecea-48bf-8475-05ec223e951a",
        "user_id": "vwilkinson",
        "content": "Snowflakes don't have skin."
      },
      {
        "comment_id": "d5995f87-b6de-4d20-835a-3b0b5aac30e0",
        "author_id": "2ee4f0c8-ecea-48bf-8475-05ec223e951a",
        "user_id": "vwilkinson",
        "content": "Delicious​"
      }
    ]
  },
  {
    "post_id": "37068d9e-c439-4a22-8aa7-b3ed68417c77",
    "post_title": "Position drop manage someone candidate rock task everyone.",
    "author_id": "770d29d8-41f6-432f-b1fe-b0066d1c6c4f",
    "user_id": "zgibson",
    "comments": [
      {
        "comment_id": "977a4974-4761-47e1-9f4f-4ca3a1c573db",
        "author_id": "607047a2-5403-4c52-b8b5-40d15f6c80af",
        "user_id": "janettapia",
        "content": "\"But it has been reported that, under the 2016 Canada Summer Jobs program, she gave nearly $12,000 to pregnancy centres in her riding that refuse to provide abortions.\" The issue isn't that pregnancy centres don't PROVIDE abortions, but that they won't refer to a clinic who does and they actually deliberately provide clinical misinformation about the safety of abortions. A person who is anti-choice can't possibly advance the agenda for women. Anti-choice does not mean pro-abortion per se...it means supporting a women with an unintended pregnancy regardless of the option she chooses...terminating the pregnancy, or continuing the pregnancy and keeping the child or putting the baby up for adoption."
      },
      {
        "comment_id": "32c73cd4-404f-4049-a004-c9d1cf13aa66",
        "author_id": "607047a2-5403-4c52-b8b5-40d15f6c80af",
        "user_id": "janettapia",
        "content": "philistine"
      },
      {
        "comment_id": "fdc0ec87-8b91-4a3e-917a-8980f767d3dd",
        "author_id": "607047a2-5403-4c52-b8b5-40d15f6c80af",
        "user_id": "janettapia",
        "content": "I posted that info above. Look at it and educate yourself, liberal."
      },
      {
        "comment_id": "136165da-6388-4ede-a1ed-b469a26e17c4",
        "author_id": "607047a2-5403-4c52-b8b5-40d15f6c80af",
        "user_id": "janettapia",
        "content": "Simply, there will always be impulsive individuals with poor judgement (or worse).  Let's stop arming them.  Take away the guns, including from all but trained secondary enforcement teams."
      },
      {
        "comment_id": "62904859-3d37-4945-b664-66b25a773cc0",
        "author_id": "607047a2-5403-4c52-b8b5-40d15f6c80af",
        "user_id": "janettapia",
        "content": "Trevor isn't sole problem. How does the defense get clobbered by a team missing 4 wide receivers? They had to know essentially what the opponents were going to do.\n\nThey looked past this team...  Didn't take them seriously. The Giants didn't have anything to lose so they played the hardest."
      },
      {
        "comment_id": "ad2e5f68-1944-479a-9ca2-11d53388e62e",
        "author_id": "97c2e3b3-1234-4f94-b689-04f9dd2da71b",
        "user_id": "popegregory",
        "content": "\"Okay, Alberta has an issue with misogynists who can’t handle a woman being in charge\"\n-\nNo where the truth\n-\n-Albertans would welcome Margaret Thatcher , Angela Merkle or some other capable / competent politician with a political bias that matches the bias of the majority of Albertas population with open arms-\n-\nBut Ms Notley ...... \"You're no Thatcher / Merkle \""
      },
      {
        "comment_id": "f926ada8-3ebf-4fc7-a493-2f9d8ae40925",
        "author_id": "97c2e3b3-1234-4f94-b689-04f9dd2da71b",
        "user_id": "popegregory",
        "content": "“We made it clear that everybody in our campaign has to follow the rules. If something has gone amiss, if somebody is signed up without their knowledge they shouldn't be able to vote,” Tony Clement said. “It's a rule we all have to live with.”\n---------------------------\nSo, no denial. Once again, it is just a lone staffer gone \"amiss\"."
      },
      {
        "comment_id": "6f1c3d6e-1bf9-4449-9142-4e9a6769ea59",
        "author_id": "97c2e3b3-1234-4f94-b689-04f9dd2da71b",
        "user_id": "popegregory",
        "content": "\"Insensible\" is a word. Brit used it correctly.\n\"English\" (the language and the people) requires a capital letter, btw."
      },
      {
        "comment_id": "fd5c298e-6b1d-4887-b229-f13cb52363de",
        "author_id": "97c2e3b3-1234-4f94-b689-04f9dd2da71b",
        "user_id": "popegregory",
        "content": "It is based on totalitarian freedom crushing gubbermint directives.  The kind that free people everywhere should resist."
      },
      {
        "comment_id": "df8ab12c-2940-407a-8d88-48272e62eab7",
        "author_id": "97c2e3b3-1234-4f94-b689-04f9dd2da71b",
        "user_id": "popegregory",
        "content": "Was the meat viable?  It seems a waste to me to just take the heads if it was."
      },
      {
        "comment_id": "94a3ddbc-df8e-47fb-93fc-4a5f3d3df831",
        "author_id": "7c40f782-74d6-46a6-8e11-e5a47a39acc6",
        "user_id": "bridgetstewart",
        "content": "They can't run now because the league caught on the Trevor can't play and the def's are stacking 8 in the box. The line is bad, and ts makes em look worse since he refuses the climb the pocket and just fades back."
      },
      {
        "comment_id": "a051051d-b598-47fc-876c-5447482ba811",
        "author_id": "7c40f782-74d6-46a6-8e11-e5a47a39acc6",
        "user_id": "bridgetstewart",
        "content": "Wish ABC stores the best in this new venture.  Sounds like it could do well in Waikiki but unfortunately I doubt that many locals will\ncheck it out as fewer and fewer locals go to Waikiki except for very special occasions .  I suppose this is not really a problem for\nABC stores as their business model has always been focused exclusively on the tourist trade and it has been successful here and \nwherever they have opened a store"
      },
      {
        "comment_id": "900b39fc-1465-4537-b349-a5b8a06e7ee6",
        "author_id": "7c40f782-74d6-46a6-8e11-e5a47a39acc6",
        "user_id": "bridgetstewart",
        "content": "Dr DrI\nt's quite contradictory to what Trudeau's critics imply.\n\nReally clear. \n\nUnless you're a Sun reader, of course."
      },
      {
        "comment_id": "77cbacfa-e8e7-411e-a657-b50623b3adcb",
        "author_id": "7c40f782-74d6-46a6-8e11-e5a47a39acc6",
        "user_id": "bridgetstewart",
        "content": "My basic point applies, whether you like Roe or not, its not going anywhere and running candidates for office because they will appoint justices who will overturn it is fraud.  You are entitled to your views, but using them to get an idiot like Trump elected is beyond the pale."
      },
      {
        "comment_id": "2c53d98c-22a2-4ed1-bb49-7ecb6e6845c4",
        "author_id": "7c40f782-74d6-46a6-8e11-e5a47a39acc6",
        "user_id": "bridgetstewart",
        "content": "what no one is mentioning, not even the paper is......How the hell was the bus started?  Hotwired or  was a key used?  There is more to this story. Yes it's BS the driver was not arrested. How dumb can a person be to pay someone $500 dollars to a complete stranger, and even how much dumber does is the AST has to be to believe that story. \"Yes officer, it was puff the magic dragon who I gave the money to\"."
      },
      {
        "comment_id": "051c2b52-64b3-4f95-936a-c8f2125045d9",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "Health and Human Services Secretary Tom Price was known to be corrupt before ever being named to the post. And now that he’s in the job, he’s enjoying the perks.\nPrice spent tens of thousands of dollars to take a private jet to travel up and down the East Coast last week.\nA private jet to a resort to chat with a pharma CEO sounds like what you might expect from a man who bought stock in a medical company, then authored a bill to boost its value.\nBut Price’s misuse of a public funds to hire a private plane is particularly egregious, because that Tom Price, is the same Tom Price who railed against government use of private planes.\nThe ranking member of the House Energy and Commerce committee said he wants to see a “full accounting” of Price’s travel."
      },
      {
        "comment_id": "e93b636d-c1c3-4fef-ae66-02d9bc0454bd",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "All the Trump nonsense (starting from when he first began campaigning, through to the latest) will pale when he begins talking about how his tried and true methods of business will solve the national debt problem: bankruptcy in his private business experience will be translated into \"renegotiating\" the national debt. \nAll who hold any kind of national debt -- bonds, etc. -- will be offered 70%, and those who refuse or delay accepting will face the consequences when the government acts to Redefine the debt. That, of course, is a complete default. \nMeanwhile, despite assurances from the White House, the stock market will slide quickly and both retail and wholesale prices -- not to mention, interest rates of every kind -- will jump and jump.\nThis will be coming out not by a programmed, neatly-formatted announcement, but by unexpected tweets, from a WH  bathroom late at night."
      },
      {
        "comment_id": "ffba37aa-22de-4aba-8377-45f950df5e87",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "I know you mean it sarcastically, but I still seriously agree."
      },
      {
        "comment_id": "b987a671-3641-49fd-9ed3-e81b0eba8b2b",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "Careful Caleb you have provided a platform for a battle between the NIMBYs and the Homelessness Industry Complex (HICs). Expect the usual suspects to commence commenting."
      },
      {
        "comment_id": "02fa045c-395d-47b1-a179-eecebbeb10cc",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "\"Despite struggling through a recession, Alberta’s sunshine list has revealed the salaries of top university administrators ....\" \n\nJust fascinating: I had no idea that it was Alberta's sunshine list that had struggled through the recession. I thought it was the people of Alberta.\n\nCopy-editors, where are you?"
      }
    ]
  },
  {
    "post_id": "4837557c-367c-4c9a-b92d-a46f6ace8fa7",
    "post_title": "Build quite course hit production address also night entire executive front town.",
    "author_id": "cfd5ebf5-b3ac-42a7-a90b-47d1df40a775",
    "user_id": "ureed",
    "comments": [
      {
        "comment_id": "0f0a77e7-e39e-4060-b0a6-e53f6044cdb0",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "Or a potatoe"
      },
      {
        "comment_id": "cb1ede97-0592-4972-aa77-99c492463b1c",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "Catholisism = Marxism = economic and social Failure"
      },
      {
        "comment_id": "edd53047-87ce-44a6-9b5f-f42b38419d79",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "Same as the hundreds of  greenhouses that provided food and  employment to 5000 Palestinians that  were destroyed  within a day by Palestinians because they had been built by Israel..     Thanks for your selective facts,  Gordon.    I look forward to you reply"
      },
      {
        "comment_id": "e4bb56dc-5ba6-482c-9dd3-aafd8e347951",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "God-awful.  Maybe Wash will be so embarrassed from these 1st 2 games @ home, they come out fired up, take no prisoners.  Maybe now, they've reached their low point.\n\nI mean, they barely got by Your Leafs, took them 6 games, and yep, playoffs are different than the reg season, but what we're watching now, the effort is so poor, this bunch is almost lifeless.\n\nEmotions, effort, stuff like that, things intensify in the playoffs, Wash never seems to play harder, tougher in the post-season.\n\nAnd they've blown it so many times now, maybe it's just ingrained."
      },
      {
        "comment_id": "b2352c10-3860-46cf-b8df-a0ff6bbd35e6",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "So Mintz is the author of deep philosophical works like \"How to Host a Dinner Party\" and is mostly known for a newspaper food/restaurant column. He should probably stick to reviewing restaurants instead of philosophy and ethics. No wonder this article gave me indigestion."
      },
      {
        "comment_id": "58f132b7-c8bf-4fa6-92ff-444464a97dcb",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "You plan those liabilities by applying a cost index annually.  \nHow about the increases to union employees that increase, too?\nTime to pass some Right to Work Legislation....reign in budgets."
      },
      {
        "comment_id": "81c215d3-8ed4-4474-bbc1-84255abed1ff",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "“The leech's kiss, the squid's embrace,\nThe prurient ape's defiling touch:\nAnd do you like the human race?\nNo, not much.”\n\n― Aldous Huxley, Ape and Essence"
      },
      {
        "comment_id": "530c4855-0ff4-4685-a073-836999cd4698",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "These Liberals are selling their souls cheaply. Still, either for  lousy $1,500.00 or two million, it is still prostitution!"
      },
      {
        "comment_id": "b9694a87-71ab-476d-97c3-b2e44a77161e",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "In Catholics for Obama, we relied on the fact that the GOP was doing nothing while promising everything. We won the Catholic vote (and it was not just this news group, I shared this strategy with NARAL and they tell me they used it too. Hillary did not go that route and lost. Now the planet is in danger and abortion will go up as poor people have more abortions. The most likely legal remedy to abortion is a higher level of government benefits, including the Child Tax Credit.  The GOP, particularly Catholic Speaker Ryan is sadly going the other way. Not pro-life."
      },
      {
        "comment_id": "10dc13fe-9159-4195-87b2-8f7eee5ff179",
        "author_id": "ed7758a8-83d5-471b-b8fe-bd6457940fb6",
        "user_id": "johnwebb",
        "content": "Great comment, thank you."
      },
      {
        "comment_id": "b75377a3-b9bc-4e2f-8a18-3b64fafde5c5",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "get some help you ignorant nut job"
      },
      {
        "comment_id": "09f354e5-68f0-4597-84e7-bb07d279185e",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "Good one Leonard. Stirring up the Trumptards is fun, huh."
      },
      {
        "comment_id": "c9814b3a-52e6-4b58-abb9-02e4b2e359b4",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "Wiki-leaks will release evidence the Washington Post's fake news story last week about the Russians supposedly hacking the US power grid was paid for by the DNC, and that will be the end of this sour grape witch hunt."
      },
      {
        "comment_id": "1082fa43-0bdd-48e7-8b63-2fc88af989f1",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "You're wrong on two counts: First, the Property Clause, which Tipaw quoted in full, has absolutely nothing to do with ports, forts, or ten miles square (not square miles, btw - there is a difference, but since you can't read for comprehension, I won't bother explaining math concepts to you). Second, at no point does the Property Clause or Article 1, Section 8 prohibit the government from owning land. If you can find the spot where it says, \"the government can own no land except this one little bit\" please feel free to enlighten the countless Constitutional scholars and Supreme Court (and lesser) judges who disagree with you."
      },
      {
        "comment_id": "311ef755-087f-40f5-8ecb-1ebb12455aed",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "Let's hope it's their deathbed."
      },
      {
        "comment_id": "818880e6-4037-4a85-b562-e31d73390898",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "EX fans also have the same \"right\", correct? Revenue is plummeting. Who do you think pays for it all?"
      },
      {
        "comment_id": "6467b1cc-dbf4-4e5a-a61c-f19d4da91b69",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "Your article caught my eye with the picture, same one I used for the cover of my book THE END OF WORK-financial planning for people with better things to do. See more at navigatingfinance.com. When I lost the million dollar business I had planned to retire on, I was recruited to sell insurance as a \"financial planner\". Have recently retired from that as well. Rather than live in Mexico (which we love and would go in a heartbeat), we live very well in Winnipeg! on about $60,000 gross with spouse part time job (she still enjoys) and my consulting gigs. We are early 70s (the new 55!)"
      },
      {
        "comment_id": "b469bf53-4f51-4ad0-adfa-476fa1d522c6",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "They also had to write off $200 Million because of the cancelled Mexican plant - shareholders could become unhappy if that happens too often."
      },
      {
        "comment_id": "1f6de185-bc55-4a6d-af8e-19c8af2d1733",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "\"Ever wonder who’s behind some of these posting aliases\"... I think it would be a gas to try to find out..."
      },
      {
        "comment_id": "f2671eae-d8e6-477d-8e46-de78761475e4",
        "author_id": "22b9ff2f-9ffb-487d-a296-b4380c8dc510",
        "user_id": "ricebeth",
        "content": "Aye...yes. That's another problem altogether. What these particular priests dress in, however, is the least of my worries. These ones tend to be of the spiritually abusive type. We just got rid of a bishop in our diocese who was the classic example of an abusive closet-case. I feel as bad for him and his inner torment as I do for the people his \"pastoral style\" victimized."
      }
    ]
  },
  {
    "post_id": "7eeaaa89-c2f4-40b2-91dc-9e7d0eade5aa",
    "post_title": "Student hold term interview sea carry indeed natural worry myself mission yeah.",
    "author_id": "2bd6bea2-5f19-43e8-9970-f657d75f6783",
    "user_id": "julia21",
    "comments": [
      {
        "comment_id": "872bf8aa-821a-4e7e-b376-354ddb6b841f",
        "author_id": "38de4f28-bce8-4c7e-af61-6eaf1ddd62d2",
        "user_id": "victor73",
        "content": "HRC way ahead in PA.\n\nhttp://www.philly.com/philly/blogs/big_tent/Suffolk-poll-Hillary-pulls-ahead-of-Trump-in-PA.html?mobi=true"
      },
      {
        "comment_id": "fa1b73bd-83a8-47c3-a635-6e2163da313b",
        "author_id": "38de4f28-bce8-4c7e-af61-6eaf1ddd62d2",
        "user_id": "victor73",
        "content": "You realize you are wrong -\nSolar and or Wind Power are NOT lower costs than natural gas---\nSorry but facts are facts --\nThen there is that pesky problem of non-windy days and non-windy or sunny nights..\n\nI favor all of the above -\nnot a govt mandate -- of we will go windy ---\n\nBesides - what a classic liberal response to a non problem - alott of bluster to sign something that says we will do something to maybe affect temp .5 degrees in 200 years---\nBUT - when your kicking off your senate run against Cory --- gotta get the manbun crowd from the coasts on your side.\n\nout"
      },
      {
        "comment_id": "0108c5c1-4901-4491-a758-e3a4546826eb",
        "author_id": "38de4f28-bce8-4c7e-af61-6eaf1ddd62d2",
        "user_id": "victor73",
        "content": "HONOR the DEED, or Deed it back to Mr. SkinnersGrandson.    If the county does NOT Honor this Documentation, than what good is the Constitution document?????"
      },
      {
        "comment_id": "f278e035-73e4-4b87-939b-2b3014a03610",
        "author_id": "38de4f28-bce8-4c7e-af61-6eaf1ddd62d2",
        "user_id": "victor73",
        "content": "Back in 7470 bc there was a Russian reindeer that stepped on to the Arctic.  It will be under this basis that Putin will declare the territory for Russia citing historical precedence.  \nCanadians of course will have to agree.\nThen Putin will take over the prairies as there is a large russian and Ukrainian population there.he will declare that they are being mistreated and so must come in to protect them.\nCanadians of course will have to agree"
      },
      {
        "comment_id": "2ab0761c-5977-4cec-ad10-14e36d8de1f0",
        "author_id": "f47b29e9-388a-48ed-8a43-4f9fc680ccd8",
        "user_id": "timothy01",
        "content": "\"Really? You don't? The Church speaks to each of us all the time about the state of our souls. If you don't hear it it can only be for want of listening.\"\n\nYour talking about the living.  I'm talking about the murdered who ever they are or wherever they may be in their beliefs.\n\nWhy are you calling a just punishment - \"vengeance?\"  It has nothing to do with \"vengeance\"- it's justice.  A person who murders another person forfeits their own life; some, only 3% of those found guilty of capital punishment ever receive the death penalty.\n\nWhy are you not concerned about all of innocent people on the outside that could become victims of those capital offenders sitting in solitary confinement with\"nothing but time on their hands.\"\n\nAnd what about all those who are murdered BECAUSE the murderer knows they won't lose their life in states with no capital punishment?"
      },
      {
        "comment_id": "37a84b81-7c81-4bc7-b6c7-158224bbd981",
        "author_id": "f47b29e9-388a-48ed-8a43-4f9fc680ccd8",
        "user_id": "timothy01",
        "content": "When the President says \"unemployment, not graft probe, biggest worry\" he has something to hide. When the chief investigator into corruption ends up in a plane crash you better get independent examiners to look into the cause or you will never know the truth."
      },
      {
        "comment_id": "3f4e28b5-5623-4592-875c-58b784bbcb18",
        "author_id": "f47b29e9-388a-48ed-8a43-4f9fc680ccd8",
        "user_id": "timothy01",
        "content": "\"It is truly strange to me that all of those who oppose abortion would not advocate for greater access to birth control.\"  \n\nCould it be that those against birth control and abortion do not give a hoot about fetuses or babies, and that all that inflammatory rhetoric is simply a ruse to control women and their reproductive capacity?  Otherwise, you would think that their so-called concern and compassion would extend to real live women- but it does not. It's all about male control."
      },
      {
        "comment_id": "d84ecef9-fd95-4ddc-8f62-2ab5d3a4ebeb",
        "author_id": "f47b29e9-388a-48ed-8a43-4f9fc680ccd8",
        "user_id": "timothy01",
        "content": "Nice try Gary. You dodged the question beautifully, you and I know China wouldn't need to buy our technology (they will steal it first) and I meant the other, less developed, countries who we would have provided subsidies too. \n\nIf Americans want to live in states like California that would push citizens into poverty to save on emissions that is their right. Trump wants the federal government out of our lives as much as possible. Which is a good thing! The states have every right to determine their action in combating global warming/cooling/changing or whatever we are supposed to call it this month."
      },
      {
        "comment_id": "c6a03b3e-5451-4551-a0a4-e2078b0bc4c8",
        "author_id": "42a210e4-0400-444c-92dc-4bc12b1ba977",
        "user_id": "steven37",
        "content": "Because it cost more to do ANYTHING here?  Obvious answer. \nIf you looked at the metrics for Anchorage, Fairbanks Mat-su only way different."
      },
      {
        "comment_id": "1d676426-cdd2-4a74-a0cb-112a8ed08f6c",
        "author_id": "42a210e4-0400-444c-92dc-4bc12b1ba977",
        "user_id": "steven37",
        "content": "And it was the Bush era Republicans that passed one of the largest unfunded mandates ever to go through Congress - the Medicare Drug Plan (Part D).  Lobbyists for big Pharma and the insurance companies removed any price controls from the legislation, allowing drug prices and insurance premiums to soar."
      },
      {
        "comment_id": "014ccd9f-e029-4e4b-ac3c-b6db8adde428",
        "author_id": "42a210e4-0400-444c-92dc-4bc12b1ba977",
        "user_id": "steven37",
        "content": "Perhaps we should all get involved in domestic violence issues by bringing more of Christ to our community. Our children now have one more incident in their conciousness that tells them the world is violent and selfish. You aren't going to eliminate violence by eliminating guns. Violence is in the person."
      },
      {
        "comment_id": "2de0b8d5-b845-412c-9c10-a233a9460cc8",
        "author_id": "42a210e4-0400-444c-92dc-4bc12b1ba977",
        "user_id": "steven37",
        "content": "We use Hydro in BC. For over 3 generations."
      },
      {
        "comment_id": "cf4591bc-ab15-49ff-9308-e62cd9e9e469",
        "author_id": "127b45ed-c8f0-4cfb-867a-53e9b3d320f6",
        "user_id": "wandasanchez",
        "content": "The issue is not so much \"fixed\" income, but \"lower\" income. even if you have a DB pension, and max CP and some OAS you are probably at a district reduction in annual income from when you were working. If you've saved well, paid your mortgage and other debts you are probably well off, but still at a fraction of your working income. If you don't have those things you have even less income. \n\nUnless the math has changed, a percentage increase of a smaller amount is less than a percent of a bigger amount."
      },
      {
        "comment_id": "1decc110-a001-4ca3-ae46-03a4a1390450",
        "author_id": "127b45ed-c8f0-4cfb-867a-53e9b3d320f6",
        "user_id": "wandasanchez",
        "content": "The headline is grammatically correct."
      },
      {
        "comment_id": "c4a5997e-4195-4360-bcb8-080bd8592a56",
        "author_id": "127b45ed-c8f0-4cfb-867a-53e9b3d320f6",
        "user_id": "wandasanchez",
        "content": "Who is talking about John Paul II?\n\nBefore getting your knickers in a knot...you may want to read Nora's claims and my response."
      },
      {
        "comment_id": "0b338b81-a70f-4f1a-a3c6-3607149a4f56",
        "author_id": "127b45ed-c8f0-4cfb-867a-53e9b3d320f6",
        "user_id": "wandasanchez",
        "content": "Yeah, they are planning on raising more taxes.  We already have a state named TEXAS.   Maybe change ours to  TAXES.  LOL..."
      },
      {
        "comment_id": "7cb0b8bb-3baa-41fc-9531-487639937856",
        "author_id": "70546973-d220-4ede-ae85-c8b1d49a813f",
        "user_id": "riosmaria",
        "content": "I've always had fixed feelings about the Iditarod. After almost 50 years in Alaska, I've been aware of many, many issues. I was also raised by a cattleman who handled cattle totally differently from his neighbors. He hated rodeos and used to say: \"Dammit, if I want to see folks beat up on cows, I'll just go to the neighbors, and they won't charge me for a ticket.\" \n\nMy Dad believed in animal rights without using the word.\n\nOn the other hand, the uber-elitism, bad manners, hyperbole and downright lying of PETA makes me think that they are bad guys. I wouldn't put it past PETA to have set this up. They're sure as hell milking it.\n\nAnd then there's the Iditarod Trail Committee. What a bunch of bozos! I believe that most mushers are in fact supporters of animal rights. Go Dallas."
      },
      {
        "comment_id": "39976999-8dee-4931-a6ee-831a2b0eeaf6",
        "author_id": "70546973-d220-4ede-ae85-c8b1d49a813f",
        "user_id": "riosmaria",
        "content": "Being a pig does not automatically make one guilty of sexual assault.  Even the \"pig\" is entitled to a fair trial.  As of yet there is not proof and the ADN is printing, not reporting - no ADN journalist wrote this particular story.  They are aiding and abetting mob behavior.  Trump is in your face disgusting but most actual predictors are very stealth and very often the ones you would least likely expect to assault."
      },
      {
        "comment_id": "8674624d-d87c-45a9-8dca-0b58a2ab3367",
        "author_id": "70546973-d220-4ede-ae85-c8b1d49a813f",
        "user_id": "riosmaria",
        "content": "Because he was too busy getting things done, rather than heading down to Juneau to politic with the idjits."
      },
      {
        "comment_id": "faec4551-61d4-438f-b92f-df61caa4e535",
        "author_id": "70546973-d220-4ede-ae85-c8b1d49a813f",
        "user_id": "riosmaria",
        "content": "Why do you think sexual assault is \"relatively minor?\" That's what I'm getting from your post: that anyone referring to \"relatively minor\" \"sexual transgressions\" must be referring to sexual assault."
      }
    ]
  },
  {
    "post_id": "f3166de3-0f64-4dc0-8ef8-5f3fecf41b9f",
    "post_title": "Consider staff there water more every good matter brother bar.",
    "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
    "user_id": "njohnson",
    "comments": [
      {
        "comment_id": "cb0d5b76-242e-4dd8-abdd-2e8b2f6995f3",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "NOTHING is cut and dried in law.  Nothing."
      },
      {
        "comment_id": "3c9fb210-7dd6-4861-97e5-6607067119b3",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "Effective oversight of any Police Department starts with a competent Police Commission.  That is sorely lacking at HPD.  Appointing politically correct individuals (for political purposes) to the Police Commission has, and will continue to be a recipe for ineffective governance of the Department."
      },
      {
        "comment_id": "0ba250f3-44d0-4cae-979f-82f811230102",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "You spelled hillbilly's driving in a circle over and over. Lol you rednecks make me sick and you all continue to show your intelligence"
      },
      {
        "comment_id": "9ddacaf9-de40-4b61-aa90-fe9a687bf3b3",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "Aloha mai e kakou a pau,\n\n All the best for the most ʻono luʻau in Hawaiʻi nei!\n\nʻO wau iho nō me ke aloha, na ʻAnakala Keaka"
      },
      {
        "comment_id": "7c6344ee-2083-4120-b906-78050a9f3d49",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "The cons all think government is a company that should be run like a company.   Not true.  Government is an entity to bind us together and bring services.  Its not supposed to make money.  Its supposed to spend money.  Hard truth but there you are.\n\nThese guys all think that it should be free. No taxes"
      },
      {
        "comment_id": "5bb8113e-0080-4ef2-b5b7-dfb5624924ca",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "At least it's not the mean-spitites secretive Harper gov't. Their contempt for Parliament and democracy will be their legacy."
      },
      {
        "comment_id": "6d1fb362-4f66-4b44-8fe1-d404a9057bcf",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "You need to read up on the Eastern Front. Russia, our ally, lost far more troops and civilians than the United States. Leningrad, Stalingrad, Kursk, Moscow, Odessa, I could name other huge battles which dwarfed any battles America faced. The Chinese losses were so great they are impossible to know with any certainty but they lost more than the Russians significantly."
      },
      {
        "comment_id": "76483757-ecac-4966-a329-9e51058b3007",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "\"...one of the most accomplished lawyers in the country is a sign how misguided they are....\"\n\nAre you Marie Henein's mom ?\n\nhttp://www.canadalandshow.com/ghomeshi-judges-son-works-marie-heneins-brother/\n\n\"We’ve asked Marie Henein, Peter Henein, and Chris Horkins for comment on the story but none of them have responded. Justice Horkins declined to comment. If any of them get back to us, we will update the story with their responses.\"\n\nStop pontificating (to those who don't really care how important that you think your daughter actually is) and come clean about the above issue, perhaps."
      },
      {
        "comment_id": "9a5d12e1-b5e8-451f-a34e-051437b40e76",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "Distressing that the author of this jeremiad is a prof at Carleton University. No mention that Clapper was guilty of perjury in previous testimony on CIA files on ordinary Americans and it was his lies that led to Edward Snowden becoming a whistleblower. He should have bounced from office in disgrace; instead he has been given a second act as a Barack Obama War Party propagandist.  The bottom line is that the Democratic National Party disgraced itself in the election campaign, the Clintons disgraced themselves over there entire careers and the Wikileaks e-mails exposed them. Whether the leaks came from Russian hackers, which Assange and UK ambassador Craig Murray both deny, or from a disgruntled Democratic Party worker, as Assange and Murray maintain, the leaks helped rather than hurt American democracy. They kept the criminal Clintons from an odious third term in the White House by properly informing the American public of their foul misdeeds."
      },
      {
        "comment_id": "14f94e7b-c09b-47fc-8e83-011e903242c0",
        "author_id": "dfdc68a7-9b42-4c4c-b87b-ba5ce55e02c9",
        "user_id": "xanthony",
        "content": "Trumpties rarely read articles on which they're commenting. That might thrust a discordant note in their echo chamber."
      },
      {
        "comment_id": "3fcb70b2-6420-48d1-8f95-9b56d4367636",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "Isn't the headline a total oxymoron?  An atheist regards Jesus of Nazareth as being, if he existed at all, a mere mortal no different than any other.  What is there to celebrate on December 25?"
      },
      {
        "comment_id": "9df5700d-63ec-41b4-bb35-b716f304ed64",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "\"There is still a lack of skilled trades in many sectors. The unemployed are mostly the liberal arts types or unskilled labour unwilling to flip burgers.\" - gtm\n\nNonsense, your statement could not be more wrong.  In Calgary, the unemployed are mostly highly educated professionals like engineers, geologists, IT, accountants and support staff.  Your comment is absurd.."
      },
      {
        "comment_id": "cda7bab6-2454-48fe-809d-cff856e5acff",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "Jay:\n\nYou are stating the obvious -- and there is no doubt that it was always going to be so. Kind of reminds me of an old saying/proverb:  As ye Sow; so shall ye Reap."
      },
      {
        "comment_id": "869e3b08-15f9-4890-9be2-3d7db4c856d3",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "You cannot fully prevent anything. Planes crash, trucks crash, ships crash, cars crash. It's the cost of doing business in a modern society. In the case of the railroads, 99.97% of hazardous materials make it to their destination without incident. I'd say that's a stellar record."
      },
      {
        "comment_id": "5c7cbd97-c516-4749-be07-501c666b8e46",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "I would say the malignancy has invaded the media.   I would try balanced, reasoned and factual reporting instead of name calling, omissions and distortions based on partisan and leftist ideology."
      },
      {
        "comment_id": "29616ba1-ecdb-4959-a80e-e010c1955253",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "Just a reminder... humans are animals."
      },
      {
        "comment_id": "19330e1a-ae6e-4937-8d9d-15e31b681d3b",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "C'mon, people, this doesn't need to become some sensationalized thing...\nNo one is trying to infringe on the rights of costume-wearers or limit free expression, they are merely opening up a discussion about the effect that mimicking or stereotyping the culture of others (especially those who don't occupy the same position of power and advantage in our society) can have on those whose cultures are misused for a cheap Halloween laugh. We're more grown-up than this... use a little sense and choose to wear something that doesn't actively hurt others - it's not a big ask, sheesh."
      },
      {
        "comment_id": "de44053b-3bec-4541-acb5-4336ec77ae62",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "Well, he is no Donald, that is for sure. \n`\nCanada could not produce a Trump, that's what socialism gets you: nada's"
      },
      {
        "comment_id": "c26cdacf-f942-4120-a3f5-b1afc7c56183",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "Oh OK, you're talking about logging public timber.\n\nA log truck hauls about 5 MBF and the average BLM or State timber sale price is perhaps $250 per MBF for average Doug=fir saw logs. How did you figure $4000 a load?\n\nConsidering the huge volume of timber Weyco cuts and the amount of forestland they own, 350,000 acres in Lane County alone (more than the State and BLM manage combined) they are not a particularly large local employer.\n\nI was unaware that the Dems controlled the Oregon legislature. I thought it was large corporations."
      },
      {
        "comment_id": "1d723d5f-0070-4027-aacc-f0bec13fd530",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "motleycrew: \"Saying that you \"understand\" their anger position etc. further links them to you, (garycrum).\"\nEXACTLY!"
      }
    ]
  },
  {
    "post_id": "a3cea48a-09cf-44c6-bd1b-bc1ea5f76315",
    "post_title": "Better base strong key when or maybe system.",
    "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
    "user_id": "fgraham",
    "comments": [
      {
        "comment_id": "50da9282-ff93-4ea8-b7f4-ad1dd3f6b037",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "Shoots, we missed it. We're on W. 57th St. in Manhattan."
      },
      {
        "comment_id": "cea45359-bdcf-461f-af08-77c01d348c54",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "Because that occurrence is so rare!"
      },
      {
        "comment_id": "ccefd088-4cfc-4b4a-a091-e094b985ae6c",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "You forgot to add me.  That makes four."
      },
      {
        "comment_id": "338d468c-a4cb-4ee5-9164-3e93791d8597",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "The $5 million the city has squndered could have build a good homeless facility."
      },
      {
        "comment_id": "eb500851-c589-4566-bfee-6aef3d1a28a1",
        "author_id": "c17f5335-4f2a-4120-9396-ecb9ba47a75f",
        "user_id": "jturner",
        "content": "Maybe you are not employee material!  I certainly wasn't.  Now retired, I only worked for others for 5 years in my working life.  The rest of the time was spent on my own business, studying and so on.  We are not all cut out to work for others.  Like you, I got bored quickly and had difficulty being told what to do by others.  Work for yourself.  Pick a non-work goal (like travelling around the world) and work only enough to achieve it. Once you are enjoying life, work will be put in the proper context: a means, not an end."
      },
      {
        "comment_id": "dc9f9314-4601-4b7c-a150-9122763d5036",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Letters to the Editor \nEugene Weekly \n2-9-2012\n\n\"It seems the leftstream media, including the R-G editors, are amazingly ignorant of this (R-G, Jan. 23), and they parrot said ignorance to an unquestioning, dumbed down populace — swallowed in toto by the same folks who got bamboozled into voting for a clown from Chicago who has saddled each and every one of us with over $12,000 in new debt in three short years of drunken spending.\n\nAs George Boosh always tried to say, “Fool me once, shame on you, fool me twice …”\n\nDon Richey, Eugene\n\nEDITOR’S NOTE: According to the Center on Budget and Policy Priorities, the Bush-era tax cuts and two wars account for more than half our nation’s deficits. See http://wkly.ws/16t\""
      },
      {
        "comment_id": "26c57cc8-5d4c-43b9-b594-d0f7183c995c",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "This is precisely your problem, not realizing that there is at least as much (if not more) freedom in ANY Spanish region (including Catalonia) as in any Canadian Province or Territory. Remember that ignorance can be fixed, you just have to take a trip to Spain (including Catalonia) and get your facts firsthand. Afterwards we can talk. Meanwhile I find it pointless having a debate with you."
      },
      {
        "comment_id": "330361f2-f2d5-4ad1-9254-6529ff64e3d5",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Liberals and cash for access ?  How could such a thing be ?"
      },
      {
        "comment_id": "25b5d016-8cfb-47ad-bfc2-3b845e2b6619",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "QuietAndEffective, You need to quote the entire Second Amendment, which says, \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\"  The entire first half of it places a condition on the right to bear arms.  The right is limited to those who are members of well regulated militias."
      },
      {
        "comment_id": "80e17271-8f77-4d68-8b47-d303c3b9a2a3",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Amen. What's more shameful is that BLM continues to avoid having a civil and productive dialogue on REAL issues, and instead harps on very peripheral situations that do not at all represent the truth, all the while adopting a policy of \"if you are not with us on this then you are against us\". It takes humility to admit you were wrong about something and try to establish a better environment for everyone - take the Andrew Loku situation, which BLM continues to profess as being a \"murder\" by the men and women that keep us safe every day and put their lives on the line. It was a tragic event without a doubt, but all facts point to proper measures taken by the officers on scene (not to mention the fact that two officers had picked him up an hour prior to the incident and drove him home). How it was a racially charged \"murder\", beats me...aggressive DEMANDS don't stimulate fruitful dialogue. We are Canadians, let's act civil and inclusive...exclusion gets us no where"
      },
      {
        "comment_id": "613291c1-c3f0-4462-a088-182d810b93b0",
        "author_id": "7f3d0b2c-de08-4a48-b34e-65e52518c78a",
        "user_id": "imoore",
        "content": "Gunfire in large expensive hotels is pretty rare so a  quick response protocol is virtually non-existent in the hotel and resort industry. The security or hotel manager will verify the guards claims before making the decision to call the police. Standard Operating Procedure - Only the security manager, manager on duty, or higher can call for police support. This means that the manager had to take the elevator up to the 32nd floor, make contact with the guard and verify their claim, then radio or call to the hotel security dispatch, which would then contact the police. Easily 6 minutes could have passed before this step was accomplished."
      },
      {
        "comment_id": "4f259c7c-efbe-4729-b452-86095a7b0f33",
        "author_id": "7f3d0b2c-de08-4a48-b34e-65e52518c78a",
        "user_id": "imoore",
        "content": "Time for a 9/11 type independent investigation.  This cloud over Trump and congress is not going away."
      },
      {
        "comment_id": "cb99c197-97a2-4bca-a1e7-9063fbbdeace",
        "author_id": "7f3d0b2c-de08-4a48-b34e-65e52518c78a",
        "user_id": "imoore",
        "content": "Islam means \"submission\". Muslim parents want to their daughters to marry within the faith, so forced marriages are happening in Toronto, Montreal , and everywhere to prevent girls from going astray.  A girl must submit her father, just as a wife must submit to her husband. We only pretend they are free to make their choices in life in Canada, because honour killing is still a very real fact of life for many women. The Shafia women died alone and abandoned. Not even Margret Atwood will talk about it because that would put her at odds with Islam.  Same for the Globe playing \"let's pretend they are just like us\"."
      },
      {
        "comment_id": "ac22a4d1-efe0-48b4-974a-f7b2551e6f9a",
        "author_id": "7f3d0b2c-de08-4a48-b34e-65e52518c78a",
        "user_id": "imoore",
        "content": "The biggest piece of dead wood being the PM himself!"
      },
      {
        "comment_id": "7fb5c5f0-8ac4-4b3f-87a5-4055ee804880",
        "author_id": "7f3d0b2c-de08-4a48-b34e-65e52518c78a",
        "user_id": "imoore",
        "content": "Part 2\nList of Scientific Societies who agree upon Global Warming and Climate Change\n1) American Meteorological Society: Climate Change\n2) American Physical Society: Statement on Climate Change\n3) American Geophysical Union: Human Impacts on Climate\n4) American Association for the Advancement of Science: ASSA Board Statement on Climate \n        Change\n5) Geological Society of America: Global Climate Change\n6) American Chemical Society: Statement on Global Climate Change\n7) U.S. National Academy of Sciences: Understanding and Responding to Climate Change\n8) International Academies: a) Global Response to Climate Change, b) The Science of Climate\n      Change\n9) National Research Council of the National Academies: America's Climate Choices\n\nAnd as an informational note:  Pope Francis, before he entered the seminary, earned a certification in chemistry [comparable to  junior college certification] and worked as a chemist.  First pope that we have who did that."
      },
      {
        "comment_id": "a7fd9c02-f6bd-453b-b015-aabfe646832d",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "Why is this news? This kind of stuff goes on ALL THE TIME in the PRC. It's ALL about negotiating a payout to someone who feels he's \"lost face\".\n\nAnd BTW, even most Chinese say never to trust people from Henan Province (where Zhengzhou is)...reputed for scammers and flim flam..."
      },
      {
        "comment_id": "42db10ff-17fa-40db-b638-dd425521d7b7",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "Well thank goodness none of the \"allowing\" is up to you.  You make so many of the usual ignorant assumptions about people you don't even know and scenarios that don't happen."
      },
      {
        "comment_id": "6e8b9f3c-7fd3-47c3-95d9-eac3c35b8bd0",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "... I'd put a higher probability on her being a pill popper."
      },
      {
        "comment_id": "65f42eda-027a-41d2-ba20-013f975246af",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "Yes sir, Americans are tired of scandals, lies, investigations and cover-ups.\n\nThanks to political hacks such as yourself.\n Decades of misinformation has taken its toll on all of us.\n\n\"Fool me once shame on you, fool me twice, shame on me.\"\n\nOr as former president Bush puts it, \"Fool me once, shame on-shame on you. Fool me-you can't get fooled again.\"\n\nDid you write that one too?\n'"
      },
      {
        "comment_id": "2e33b797-f7ec-4a64-a735-6898d2966e80",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "Time for Justin to take off his shirt again.\nThe Liberals need a new distraction."
      }
    ]
  },
  {
    "post_id": "34b83c4f-dfd0-45d8-bd78-26d4d0fd8fb1",
    "post_title": "Bag everything provide leader Mr class trial staff care film put age.",
    "author_id": "9da77abf-5b82-4d72-b945-2e8b5fc15e7f",
    "user_id": "lewisbrian",
    "comments": [
      {
        "comment_id": "2ba18471-c353-4516-8ef0-6506f0e4fee2",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "It's clear that he'll never enjoy the \"full confidence\" of the American people.  After all, he lost the popular vote by a huge margin - of course his ego has him claiming that he would have won it by a yuuge margin if it hadn't been for the millions of people that voted illegally (and, even with zero supporting information Fox and the rest of his supporters swallowed that without questioning it).\n\nAnd of course he wouldn't admit that Russian hacking had anything to do with the outcome of the election - again his ego won't let him accept that.\n\nIf we add in the actions of the FBI (Comey) immediately before the election it's pretty clear that his win, while legal, was hardly legitimate [he won three states by less than 1% and another by less than 2%]"
      },
      {
        "comment_id": "7d7a966d-653f-44e0-a8dc-3b18246cb18f",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "LOL - never encountered it here? If you want to see inflammatory & gruesome rhetoric about abortion - read your own posts! - and stop polluting this site with them."
      },
      {
        "comment_id": "941300ab-f9e3-4898-be6c-1b3b680aace9",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "All interesting topics worthy of discussion, Lynn,  but as you can see from many of the comments here, far too many people are interested in personal attacks and assigning blame for perceived transgressions, real or imagined.  An increasing number are choosing anger over analysis, ideology over ideas.  I try to be optimistic, but the spewing vitriol is creating an increasingly difficult environment  for having dialog... which I fear is the objective."
      },
      {
        "comment_id": "f9979b95-fad1-43b6-b800-81b88dc7f928",
        "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
        "user_id": "russelljustin",
        "content": "Well put Sir."
      },
      {
        "comment_id": "a2e0eea9-4c54-492e-9de5-b00c52e934da",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Seems like the Clintons have started a trend..."
      },
      {
        "comment_id": "298c6c5b-a984-4143-abf7-e08efdfb0823",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Qbcoach15>  You sure talk a good show, don't you????  Why don't you first tell all your DEMs/LIBs/Fake News Gang to follow your advice, huh????  They sure like to insult peoples' mothers, right????"
      },
      {
        "comment_id": "12bf2d37-5284-49b4-be4e-4ba0a79ab646",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "I hope this lady recognizes that even the great Gandhi whose compassion and love was in line with Jesus, supported the national rights of India (Indians) over the unconstrained growth of Britain's reach in that country.   It did not mean that he rejected other cultures and in fact was educated in Britain, but he did recognize that each country should have the right to self determination.   Right now our self determination is made for us by the grossly wealthy and blind politicians who live in bubbles.  But all people need to be treated with fairness and respect...just doesn't mean our doors are open 24/7...."
      },
      {
        "comment_id": "251f7fd3-db0c-4c13-aca5-5ed9d1b49871",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Go Ducks!"
      },
      {
        "comment_id": "4f55024e-fa8d-4d9b-b1cf-d83669b7c4c9",
        "author_id": "a5d78659-77c7-4e8c-ad47-e3bafde261a8",
        "user_id": "znguyen",
        "content": "Trump's refusal to listen to any of our intelligence agencies is especially disturbing, apparently he's going to quite literally make things up as he goes.    I just can't wait until he has the military and all our weapons at his disposal!"
      },
      {
        "comment_id": "f2ea1566-9294-4833-8a94-119fb56cc1c0",
        "author_id": "a5d78659-77c7-4e8c-ad47-e3bafde261a8",
        "user_id": "znguyen",
        "content": "Taking on debt so that the .01%ers can avoid paying taxes is a completely different situation than investing in infrastructure so that jobs and economic activity gets dispersed. Paradox of thrift is still a valid concept. Take a yuuuge mortgage to flip a house is different that someone buying a house to live in. House flippers don't need washing machines and furnishings- which generate secondary spending. And no, this is not trickle down economics. That is a different thing.\n\nWe had the business leaders running the US Treasury for too long. It didn't end well for the average family or middle class worker. Watch the \"big short\" or \"Capitalism not a love story\".  Rich simple got richer. \n\nIf you are going to incur debt to increase GDP, put it in the hands of people who will spend all of it within local economies on tangible goods and services."
      },
      {
        "comment_id": "8da933d4-3c19-42b8-880e-2bf9adc5fbff",
        "author_id": "a5d78659-77c7-4e8c-ad47-e3bafde261a8",
        "user_id": "znguyen",
        "content": "UCLA is very good at this stage. Hawaii hoping for a split which likely not happening. I say go for it and don't let up like at BYU.  All in or nothing!  No fear.  Rooting for the best and sweep them at their house! Go Bows!!!"
      },
      {
        "comment_id": "5678be2f-06d9-4088-8a04-7f516bbd404b",
        "author_id": "a5d78659-77c7-4e8c-ad47-e3bafde261a8",
        "user_id": "znguyen",
        "content": "Gary called Don a \"troll\" because that's what he is. Truth is civil. -- Paul"
      },
      {
        "comment_id": "41cfcd73-84c1-4b86-bcd8-62027c86074a",
        "author_id": "d73fa2d7-3c2e-4b8a-8926-50be3c10ae29",
        "user_id": "kanderson",
        "content": "What happens if the YES votes in the upcoming election are 50.5% and the NO's are 49.5% and the flouridation machine is turned back on? Will that heal the community or just make the discord worse?"
      },
      {
        "comment_id": "6a3600ce-6046-4698-bbd5-4e1940026f3d",
        "author_id": "d73fa2d7-3c2e-4b8a-8926-50be3c10ae29",
        "user_id": "kanderson",
        "content": "The dog probably did vote for Bernie as well as Clinton just to be safe."
      },
      {
        "comment_id": "7d6f8252-b2a9-419a-bac1-0a4ff5a22696",
        "author_id": "d73fa2d7-3c2e-4b8a-8926-50be3c10ae29",
        "user_id": "kanderson",
        "content": "Well I see that they're starting by gutting the independent congressional ethics panel - just the type of thing one would want to get rid of if you wanted to get away with stuff most law abiding citizens would deem 'inappropriate'.   Good optics here.  \n\nIt took GWB and his band of Republicans well into his 8th year to bring the economy to its knees and almost put us all into a depression.  With the assistance of the Republican dominated Congress I'm betting that Trump and his troglodytes in the WH will prove to be more efficient than GWB by doing it in his first term - assuming, of course he don't start a nuclear war first."
      },
      {
        "comment_id": "4f94d465-5586-4127-9788-91cb168873d4",
        "author_id": "d73fa2d7-3c2e-4b8a-8926-50be3c10ae29",
        "user_id": "kanderson",
        "content": "NO country with black leadership, has ever prospered\"\n\nPresident Obama, a black man, brought us back from the Great Recession. And that's with white conservatives attempting to obstruct him at every turn. \nYou alt-right guys have no sense of actual history."
      },
      {
        "comment_id": "39bf360a-af7e-4f19-b2af-32f3139c0f05",
        "author_id": "a6687ecd-69c7-469f-824f-5d70113b735d",
        "user_id": "justinrosario",
        "content": "You are the clueless one AT.  When you stop paying your property taxes the public entitites will alert the credit rating agencies.  They wont wait until full foreclosure.  I am not surprised that you are clueless about this.  Anyone who believes that \"a large amount of chaos\" is a solution for public financing is obviously not very savvy financially.  Sounds more like an angry lashing out.  But, hey, go for it.  Wreck your credit rating.  That'll teach them!!"
      },
      {
        "comment_id": "f02070ed-631e-4df4-840e-47cac25e73b6",
        "author_id": "a6687ecd-69c7-469f-824f-5d70113b735d",
        "user_id": "justinrosario",
        "content": "Exactly!  When you bring home $100,000,000 a year in wages and benefits, and then pay your workers $10 an hour, you are likely to pay more in taxes, even with all those loop-holes designed for the .001%.\n\nWhy is this fact being hidden, and who is dong the hiding?"
      },
      {
        "comment_id": "ced7d167-9a4c-4dd0-9ee3-89b88eb93ba9",
        "author_id": "a6687ecd-69c7-469f-824f-5d70113b735d",
        "user_id": "justinrosario",
        "content": "I do not recall Jesus making that distinction.  To Him, our Savior, it was one and the same.  You cannot love the Father without loving our neighbor.  Do we agree on this?"
      },
      {
        "comment_id": "39c142e9-7280-4c2d-8f0a-0b3e5b0be615",
        "author_id": "a6687ecd-69c7-469f-824f-5d70113b735d",
        "user_id": "justinrosario",
        "content": "Compared to the rest of the clown car cabinet, I will concede that he is something of an adult.  Nor does it even matter if he is an oil man.  The planet is doomed anyway.  Putin will doubtlessly give him another medal for helping things along."
      }
    ]
  },
  {
    "post_id": "7146d09f-b0bb-4b4f-a7c6-163d2d3fdce3",
    "post_title": "Say important like ago school serious then turn.",
    "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
    "user_id": "ltaylor",
    "comments": [
      {
        "comment_id": "53cf1f82-0732-41e3-9d07-cc780fbfbaa0",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "aa  the usual left wing stupidity never ends. harper was a leader who kept canada going well after the worst world crash in decades bud.. what is repugnant are the terrorist lovers that think we should ignore the threats"
      },
      {
        "comment_id": "fa12174a-c58d-40b8-8707-e4bb6b952117",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Christy Clark lost the election and the party took a step back.   Obviously, a change of leadership is going to happen - it's natural and inevitable.  I think she had a majority support from her team - most were recruited by her and why wouldn't you want someone who is experienced on both sides of the bench on your team.  The BC Liberals only have a handful that served more 16 years in government. Clark did a lot more in six and half years than all the BC NDP did in a decade of governance.  Moreover, unlike the BC NDP, Clark actually knows that a party can only truly move on when the old leader is no longer hanging around - you can say she was push or whatever, but have a look at all the old leaders that BC NDP have kicking around - Carole James and Adrian Dix - you can't even get rid of them and they want folks to believe that they are somehow different.  Clark's resignation is probably a real loss as you have one less experience member of opposition to hold the BC NDP to account."
      },
      {
        "comment_id": "661b3753-7a31-4515-8425-8b70a938ced3",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "It's clear that he'll never enjoy the \"full confidence\" of the American people.  After all, he lost the popular vote by a huge margin - of course his ego has him claiming that he would have won it by a yuuge margin if it hadn't been for the millions of people that voted illegally (and, even with zero supporting information Fox and the rest of his supporters swallowed that without questioning it).\n\nAnd of course he wouldn't admit that Russian hacking had anything to do with the outcome of the election - again his ego won't let him accept that.\n\nIf we add in the actions of the FBI (Comey) immediately before the election it's pretty clear that his win, while legal, was hardly legitimate [he won three states by less than 1% and another by less than 2%]"
      },
      {
        "comment_id": "f34be90b-10bd-4ded-953a-99b85c597722",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Thanks for everything coach! Enjoy retirement!"
      },
      {
        "comment_id": "6bee3e40-6e95-4451-a778-0d5bd85cd0e2",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "\"the anti-democratic cabal\"  Needs to be edited.\n\nIt should read \"the anti-Democratic cabal\" to reflect what actually is the problem here."
      },
      {
        "comment_id": "2294e213-a558-4299-af4d-00adc7cca975",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Thanks tips. Neither are we so why are we forced to act by way of taxes?"
      },
      {
        "comment_id": "2451a18a-30bb-4340-9eb9-e00251ac300b",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Why would we want to avoid a Trump? We have our own version of Hillary/Obama and he's a joke."
      },
      {
        "comment_id": "fcd4f06a-b6bc-4b04-bd93-3444417ecfe1",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "It is silly but not \"just\" silly... it is also true.  Much like how the word \"populist\" has been hijacked by the extreme/alt-left, divisive is used -by the MSM- mainly to infer \"racism\".  The funny thing is that the actual definition of populism (\"support for the concerns of ordinary people\") is exactly what terrifies the MSM and the hardliners on the Left."
      },
      {
        "comment_id": "3498ee5d-9b11-4168-85f8-93b0cafee6d3",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Authorities for years pulled people over for impaired driving without a breathalyzer. Touch your nose, look at the light, walk the line, say the alphabet backwards. \n\nThis idea that we need a perfect machine and extensive regulations in place to deal with every possibly eventuality is rubbish. There's no evidence marijuana us impairs driving ability, and no reason whatsoever to think that existing impaired driving laws do not capture such impairment if it exists. \n\nDo the majority want laws just because they love regulations and red tape, or do you want laws that are sensible and effect some useful public purpose?"
      },
      {
        "comment_id": "d5fa9bc7-5a37-4e58-8614-4c57f26b521a",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "The article is about Doug Ford and the Tory leadership. After reading it you conclude that Justin Trudeau was once a drama teacher.  \"Clear Thinker\"  eh??"
      },
      {
        "comment_id": "c4f6f6b4-1c1b-45e2-a529-1b8f9c2c89e5",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "The former POTUS should have been."
      },
      {
        "comment_id": "57b311ca-c2e9-4bcc-ab02-3d41fc1528bc",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "The establishment is being rejected on all levels - Brexit, Hillary's loss, and now the shunning of Theresa May are all inter related."
      },
      {
        "comment_id": "7592bb3a-04fe-48c9-bd2f-cf48cc28e08c",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "The WH should tell CNN they are free to send another reporter but Acosta is banned given this act and his yelling at Huckabee-Sanders earlier this week."
      },
      {
        "comment_id": "e06b98cb-8d5e-437e-9ebc-7e8d20c8b888",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "Score one for the good guys....."
      },
      {
        "comment_id": "5d1dec76-0ed7-429e-9cd2-2f032cfe2c1d",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "Agree...with success comes expectations...At one point in June the team was 21 over .500 and now they are barely holding onto a WC spot. It feels just plain bad even if the initial expectations were about a .500 team on paper..\nYou have to seize the opportunity whenever it presents itself...look no further than the Mets, who 2 years ago were in the World Series and with all that young starting pitching...it looked like they were setup for a good 5 year run."
      },
      {
        "comment_id": "44b77967-913e-4d4d-b2f1-e126efc9d6ce",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "If there is a bidding war over Amazon, the City of Denver should not go it alone.  Perhaps the state taxpayers should join Denver taxpayers in outbidding Dallas, Phoenix and other cities involved in the auction."
      },
      {
        "comment_id": "fca695af-3b50-4ff0-98ea-97a8d25976c4",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "What baffles me is people who smoke when the air is as bad as it's been. Isn't hard enough to breathe without making it worse?"
      },
      {
        "comment_id": "1517ec1c-ff34-4450-a33e-6be616c472f7",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "Thanks for the invite. Sorry I can't today. I need at least a weeks notice for I'm recovering from abdominal surgery. I also can't drive for a month so my mobility is tight. Let's try for the same time next week? I'm looking forward to it."
      },
      {
        "comment_id": "1d1ece3e-bca6-448f-a04f-9cbc97f8936f",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "Not a surprising comment coming from someone who is bereft of sound reasoning capabilities. If you believe that it is  robbery attempt as police posit then why wasn't his wallet, cell phone, credit cards taken? The motive of robbery is based on things getting stolen which is not the case here. People don't get shot in the back for nothing."
      },
      {
        "comment_id": "99ecd5e3-be47-4637-98b4-0e2a0a2139b4",
        "author_id": "4dbc2ee2-a019-40d1-83f9-6932e4146693",
        "user_id": "qfrazier",
        "content": "BMO Investorline does a nice job of tracking  that for me."
      }
    ]
  },
  {
    "post_id": "dbbb8b8f-da53-4673-b754-b7e9dad7659f",
    "post_title": "Usually past fund they second true they three gun view back.",
    "author_id": "cca7170f-7d15-465d-bace-6427a0f46266",
    "user_id": "patrickvargas",
    "comments": [
      {
        "comment_id": "e9f3ccf5-6361-45ad-adea-b6e276d4465a",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "if you can fold a fitted sheet, then you have my utmost respect!  I bow in homage!!!"
      },
      {
        "comment_id": "423090ca-a867-403e-86a9-54dfabfdf911",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "If people don't have guns, they will use vehicles, knives, stun guns, tazers, clubs, bricks, rocks, acid, bombs, or simi-trucks take all those away and they will find something to kill some one with. The fact is you need protection in todays world. There are some armed countries, Mexico which is right next door, out there. If they think you are unarmed, they will come harder then they do now. Disarm the world and I will drop all my guns except for hunting. Till then if a safe environment is not provided for me, I will make my own. It is not that common for stories about good guys with guns to be published as compared to stories about bad guys."
      },
      {
        "comment_id": "ab35a834-afbd-4ab3-9d7d-f7fd99b8419b",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "How is it that you can spell profanity correctly but not ordinary words like \"best\" or \"next\"."
      },
      {
        "comment_id": "62ec737d-b5e0-4a52-8954-becb7e581398",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "For all the billions it will drain out of the economy, it will not change the air, water or land.  It will only provide the Liberals more money to hand out to most  favoured peoples, like Natives and Muslims.  For every dollar the tax raises, the government will spend two."
      },
      {
        "comment_id": "42ac063d-6b1b-4bf6-8e32-e2476a2caa59",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "Funny, a lot of people thought Obama was the real Manchurian candidate. \n\nPrinceton, isn't that a State Dept. and CIA school? Did you draw the short straw for the Canada desk?\n\nAs for \"Never has an American politician, let alone the president, so publicly dismisses his own intelligence finding...\" Google JFK and Bay of Pigs. \n\nAnd did you skip this module in \"history\" class? \nhttps://www.cia.gov/library/center-for-the-study-of-intelligence/csi-publications/csi-studies/studies/vol47no1/article02.html\n\nThe more things change, the more they stay the same."
      },
      {
        "comment_id": "bf929353-34b4-427d-8145-d55be60d333d",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "It is time for me to head to Texas with a gun, just in case I see Greg Abbott.  Funny, huh?"
      },
      {
        "comment_id": "b66c51d9-af19-4473-b5f1-918d4787d7fb",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "I can see how an Islamofascist would hold the perspective of Trump being a fascist himself."
      },
      {
        "comment_id": "69d845ac-8839-4e54-9e02-66012983b7f2",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "So you're encouraging the woman to not have the baby that  you don't want to care for?"
      },
      {
        "comment_id": "4abaec56-bce3-4ae0-bde9-86ac4e357782",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "I suppose you're also in favor of reducing the size of the military. Or maybe eliminating it?"
      },
      {
        "comment_id": "216493ad-7079-4523-937f-51102065b31c",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "My advice. For the next 5 years just buckle down and save every dollar you can. Make it a challenge or not,  and just continue doing what you are doing."
      },
      {
        "comment_id": "6b4bb8ac-a9e9-4613-acfd-4cdced6f7d3a",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "This is nuts, and a slap in the face of all the immigrants who have done it the legal way. Why bother jumping through those hoops when it doesn't matter?\n\nLet's just open the borders and stop pretending we have any."
      },
      {
        "comment_id": "b88098ad-9704-4ce6-a03d-5d497086ba51",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "He certainly doesn't appear to be honoring his promise that the pipe would be manufactured in the USA.  Didn't you read the article?  Talk about alternate reality.  He won't keep a lot of other promises either, because they didn't make sense when he made them and he is very slowly learning that.  The suckers who voted for him will soon figure out he has neither the ability, nor any intention of keeping all his promises and they, like you, will be very unhappy when it dawns on them."
      },
      {
        "comment_id": "551ab3b8-4449-410d-9ed8-455d1df3348f",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Shhhhh. You're not supposed to use facts to blow holes in liberals emotional arguments! It's a micro-aggression and hurts their feelings causing them to need safe spaces!"
      },
      {
        "comment_id": "d7fd016d-b446-446a-947e-51a15fff3f43",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "The author's observations aside, there were fewer than 100 parish priests ordained in France last year, and about 40% of active priests are 75 years of age, or over. (Source:  Le Figaro).  France is not unique in this regard.  Folks, if you want the Church to survive, it has to have priests, and it has to allow both married priests and female priests to survive."
      },
      {
        "comment_id": "b63a15f8-b74b-438b-ad0d-4bbd0f36e8e2",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Actually, any person who is not a Canadian citizen can be deported for committing a crime.\n\nYou really should update yourself on Canadian law instead of drowning in self pity."
      },
      {
        "comment_id": "f532742b-c114-49ce-9103-e79bab16ff73",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "This is a nice op-ed, but what happened to the hard charging Springfield during the years of Morrisette and Leiken when they were leading the city.  I hate to say it now Springfield seems to be taking a back seat to Eugene again.  I loved hearing the slogan, \"Welcome to Eugene, the Gateway to Gateway.\"  Personally I believe Sean Dunn can bring that attitude back, but who knows."
      },
      {
        "comment_id": "5d9ff927-4bf6-456e-a32d-e96e99be013a",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Yes, the CTV photo is odd. There might have been some facial fillers and make up contouring, a la Kardashian."
      },
      {
        "comment_id": "20f4268a-6641-4532-bf8a-b79cd9adac5e",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Much has changed at Punchbowl cemetery."
      },
      {
        "comment_id": "d0bd4ec9-ff30-41c9-9616-c8321673cb30",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "That doesn't excuse your pathological hatred for half of the population"
      },
      {
        "comment_id": "da983346-a88e-4c9f-b785-69bf5df741ba",
        "author_id": "7a910294-ff5c-4b23-b9b4-4993f7e59690",
        "user_id": "emilyhenry",
        "content": "Yeah, see how far that behavior gets you with the POTUS.  LOL  Besides, you think exhibiting the same disrespectful behavior puts you in the right?  That's even funnier!"
      }
    ]
  },
  {
    "post_id": "924b99d5-b792-4e91-95b8-09116b951707",
    "post_title": "Road alone wife plan husband international build.",
    "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
    "user_id": "rstark",
    "comments": [
      {
        "comment_id": "215bedf4-518b-4e1d-831b-8a1be54e73c8",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "But, as of yet, NO connection to President Trump.  \nAnd, by the way, the U.S. has done similar tactics trying to affect elections in other countries.  Obama certainly did trying to affect elections in Israel for instance."
      },
      {
        "comment_id": "20bd5efe-cd88-4ced-8c4e-13d1aaf86f55",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Rich people really don't avoid paying taxes ...they are able to steer policy and hire accountants and tax attorneys and are able to manipulate the system to their benefit to a certain degree but they still pay the majority of taxes."
      },
      {
        "comment_id": "dd874258-e284-41e0-9abb-455e3be97cff",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "the Catholic SJW's need to get their thinking straight.\n\nThe people who try to immigrate here, both legal and the illegal ones, tend to be the doers/enterprising ones in their country.\n\nNo SJWs ever seem to think about what skimming off the enterprising citizens of those countries does to their country.\n\nHalf thought activism."
      },
      {
        "comment_id": "83bb45df-b125-4676-9ac0-62f6621c167a",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "More make believe \"whataboutism\" from the alt-right.  This article has nothing to do with Trudeau.  But since you started this nonsense, Trudeau as leader over Trump any time and twice on Sunday.  Canada is fortunate we do not have a Trump as leader.  Only Reform Haters wish ill on Canada enough to cheer-on Trump."
      },
      {
        "comment_id": "1f26b0b7-11e0-46e4-9cec-19d613e2856d",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Actually, most milennials have just left the Church and Burke's brand of fundamentalist is why they left.  Take it from an actual \"milennial.\"  And the little monster priest you are talking about are the ordained version of the Red Pill guys.  Most should have been dismissed from the seminaries because of their immaturity."
      },
      {
        "comment_id": "09f8bdbf-3e7f-4a59-863a-433fbf8f16b3",
        "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
        "user_id": "robertburke",
        "content": "Lee Cataluna has started a Go Fund Me acct to thank the Board of Water Supply for doing their job again. Email he for details."
      },
      {
        "comment_id": "5614f40f-a19e-4c8c-84b2-cf2da110eef8",
        "author_id": "082ade6b-44f3-46cc-a724-82856201f8a3",
        "user_id": "faulknerdenise",
        "content": "There is a difference between a spank on the bottom and beating a child's skull until he bleeds out his ears.  But that is lost in the hysteria.   Discipline must be in balance with the bad behavior, but also sufficient to get the kid's attention that some behavior is simply unacceptable.  I see a generation of emotional of screwed up snowflakes who  are  impervious to the feelings of others, who were never spanked.  They have no concept of the limits of their own freedoms vis--a-vis the rights of others. Some kids need to be spanked  for their own good.  It is a preventive measure against escalating abuses by the kids themselves.  It tells kids \" The line is drawn here\".    Sensitive discussion of bad behavior with an 8 year old is a fool's game."
      },
      {
        "comment_id": "6be4e84a-6443-43e6-93bc-bf69636a161a",
        "author_id": "082ade6b-44f3-46cc-a724-82856201f8a3",
        "user_id": "faulknerdenise",
        "content": "What I remember most about Reagan as Governor of California and President was his ability as an outstanding speaker.   He was the perfect actor with a genuine smile and personality that made him a favorite for the job of President.  On the other hand, he was the perfect shill for the conservative side of the political spectrum. He single handedly closed down the majority of mental institutions in this country that eventually led to the homeless crisis we experience today.  And, more than any other politician in my lifetime,  he was responsible for destroying a large number of unions that  led to the dismemberment of America's Middle Class.  Reaganomics and his trickle down theory of wealth generation failed to rejuvenate the Middle Class over a long period of time.\n\nHe served as the perfect front man for the hidden power behind the scenes in the world of conservatism, as did George W Bush, resulting in a ruling oligarchy of billionaires that run the country today.   Democracy?"
      },
      {
        "comment_id": "4ed05e0e-5938-4212-8f4b-aa6906cd9773",
        "author_id": "082ade6b-44f3-46cc-a724-82856201f8a3",
        "user_id": "faulknerdenise",
        "content": "Sergio's the man.  Everything comes to he who works and works. A job well done"
      },
      {
        "comment_id": "a63d11e2-2c7b-4699-a865-6d7b0670e619",
        "author_id": "082ade6b-44f3-46cc-a724-82856201f8a3",
        "user_id": "faulknerdenise",
        "content": "If there's a bad choice available, Trump will make it! His latest pick of David Friedman as ambassador to Israel will most certainly not bring peace to the middle east. Does he want more Muslim extremists? Because that is how you get more Muslim extremists."
      },
      {
        "comment_id": "f76071d8-d667-4d52-b075-52fd24b56524",
        "author_id": "082ade6b-44f3-46cc-a724-82856201f8a3",
        "user_id": "faulknerdenise",
        "content": "Ironically Scheer actually seems to be supporting the tax changes,  since he thinks they are so good that they should even be expanded to cover family trusts.    Also,  I suspect that he is making a mistake in his personal attacks on JT,  since the PM has always acknowledged that he has been very fortunate financially.  Are we to think that any wealthy person should not be in politics?  Unless there is an accusation that he has somehow done something illegal,  then my guess is that most Canadians will see these attacks as cheap and personal.  Also, from what I understand family trusts are a completely different vehicle from professional corporations and the tax system is not at all the same,  so the changes cannot be identically applied to both vehicles."
      },
      {
        "comment_id": "88bd1de4-c0bf-4b95-a441-33b5cfea5fb9",
        "author_id": "082ade6b-44f3-46cc-a724-82856201f8a3",
        "user_id": "faulknerdenise",
        "content": "Ideally, any baptized person whose called to priestly ministry is validated by the Church can and should be ordained.  In the Catholic and Orthodox traditions, I hope to see celibate women ordained *before* the celibacy requirement is relaxed.  The numbers of priests would double overnight, and the vocations shortage can thus be alleviated in the short term.  This is the way I see the situation unfolding:\n\nReligious Patriarchy ~ Annotated Chronology of Key Events\nhttp://pelicanweb.org/CCC.TOB.html#CHRONOLOGY\n\nThe patriarchal priesthood of the Old Law is a yoke that is not easy, and a burden that is not light.  It is by no means normative for the sacramental priesthood of the New Law, and is now obsolete and utterly irrelevant.  As far as I know, there is no dogmatic impediment; so, why not?  The pluses and minuses of a married priesthood can be reconsidered in due time; but   further delaying the ordination of celibate women is to perpetuate an ancient error devoid of revealed truth."
      },
      {
        "comment_id": "00c4c418-33eb-48c8-9f3b-5946c1ed74cc",
        "author_id": "1d8b1073-cfee-413c-8ff2-71dca543824f",
        "user_id": "howelljames",
        "content": "Those who are Pro Life against abortion and nothing else are uncorrect: they do not understand that Pro-Life means from conception to natural end, paying respect to human life always, at all age and for all."
      },
      {
        "comment_id": "dd29eba4-b76a-42e6-aef6-516867cc69d9",
        "author_id": "1d8b1073-cfee-413c-8ff2-71dca543824f",
        "user_id": "howelljames",
        "content": "People can fret about a lack of proportional representation in Canada, but at least we have never had a Prime Minister from a party that did not get the most votes.  The US has had 2 such elections in the past 5 (both Republican).  The national elections there are somewhat gerrymandered.  The congressional ones are far more so, to the point that this happens regularly.\n\nNow, the last Prime Minister probably would have had the majority of the voters rank him last place on the ballot in 2011 (had we bothered to do that).  That's a bit of a problem for us."
      },
      {
        "comment_id": "3c84138e-d5ed-4562-aee0-0f8808a0f1c3",
        "author_id": "1d8b1073-cfee-413c-8ff2-71dca543824f",
        "user_id": "howelljames",
        "content": "Well, we found out what was in the bill, didn't we?  For Blue State Oregon, it was $320 Million and counting for...... wait for it......  NOTHING!   Thank You, Mr President.  Thank You, Democrats.  Thank You, Gov Taxhaber.  Thank You, Madame Speaker.\n\nhttps://www.youtube.com/watch?v=lEb2inNby04"
      },
      {
        "comment_id": "6cf982d3-de49-4b14-8433-32f4d3e81923",
        "author_id": "1d8b1073-cfee-413c-8ff2-71dca543824f",
        "user_id": "howelljames",
        "content": "Hello PW7, to the contrary, it is logic and math that leads the destination I described. You just yourself admitted that there are various wars and persecutions in the past many months worldwide, Earth is like a farm with a hurt chicken and a hurt rooster and a hurt sheep and a hurt duck and a hurt cow and a hundred other different hurt animals.\n\nAnd yet, gee, over those many months, which SINGLE, SOLITARY farm animal does the Canadian press and Canadian elite activist core go ABSOLUTELY GA-GA over?\n\nWell, quelle coincidence (roll eyes), they JUST HAPPEN to pick the one single solitary animal that had America's name written all over it (the set of refugees impacted by Trump, being processed by US authorities for seven countries).\n\nGive me a break. This is America-obsession writ large."
      },
      {
        "comment_id": "37383ce2-bc92-41a7-9786-89c6fbf1455d",
        "author_id": "1d8b1073-cfee-413c-8ff2-71dca543824f",
        "user_id": "howelljames",
        "content": "Those who pay the most should get the highest reduction in taxation, those who pay the least should be made to get off their a55es!"
      },
      {
        "comment_id": "7e5ffe8f-da56-4af5-9361-0c464258f74e",
        "author_id": "1d8b1073-cfee-413c-8ff2-71dca543824f",
        "user_id": "howelljames",
        "content": "\"We can't turn back the clock of 16 years overnight,\"\n\nThey want to turn back the clock to 16 years ago?"
      }
    ]
  },
  {
    "post_id": "edeb693f-e5f9-4f6a-9759-72574bff655f",
    "post_title": "Owner probably trip throughout successful score nice such to daughter fire agree number.",
    "author_id": "6e024992-e30b-4922-b624-550d032abdae",
    "user_id": "bauerrenee",
    "comments": [
      {
        "comment_id": "22ce012e-5296-4260-84a2-ebd4b2758309",
        "author_id": "8b5541ba-ba8a-4cca-b03a-b486aecf0b7d",
        "user_id": "xosborn",
        "content": "Solution: Follow state law and stop being a lawbreaker.\nSolution 2: Do not open a business if yuo can not follow the state laws you agreed to follow.\nSolution 3: Open your business in a state that allows such discrimination.\n\nThe baker is is lawbreaker."
      },
      {
        "comment_id": "43510fad-2477-4ab3-aadd-d1aff7b9339b",
        "author_id": "8b5541ba-ba8a-4cca-b03a-b486aecf0b7d",
        "user_id": "xosborn",
        "content": "My working theory is that they're an extension of Republican America's foreign policy arm.\nAll Empires have them.\nSort of like Erdogan's Party."
      },
      {
        "comment_id": "eebf4ffc-b11d-436b-aafe-309342f5233a",
        "author_id": "8b5541ba-ba8a-4cca-b03a-b486aecf0b7d",
        "user_id": "xosborn",
        "content": "Even if there's no actual kid involved, if you 'show up' (\"take the meeting\") to meet one, yes, you'll still be charged with conspiracy to commit the crime.\n\nFacts still remain facts, despite your inapt analogy."
      },
      {
        "comment_id": "a4576316-b490-4a70-bdf9-c72c4a9e50ae",
        "author_id": "8b5541ba-ba8a-4cca-b03a-b486aecf0b7d",
        "user_id": "xosborn",
        "content": "Whazzie: Bozak and Gardiner are not smart enough nor tough enough to play with these kids. Sorry pal, but they should have been sent packing  along with Phaneuf just before they hired Carlyle."
      },
      {
        "comment_id": "e96e5b9a-8212-491f-9c6b-7134567188a3",
        "author_id": "8b5541ba-ba8a-4cca-b03a-b486aecf0b7d",
        "user_id": "xosborn",
        "content": "Or...punk..coward...etc"
      },
      {
        "comment_id": "860aa751-78f8-4c8d-84b3-616f037c315f",
        "author_id": "8b5541ba-ba8a-4cca-b03a-b486aecf0b7d",
        "user_id": "xosborn",
        "content": "Yeah, those Subaru's are great.  When I learned to drive in the snow and ice pretty much all that was available were rear two-wheel drive cars.  Of course, they did not have all the fancy stabilization stuff that makes it hard to do really fun back and forth maneuvers."
      },
      {
        "comment_id": "a22453b9-c1a1-46fd-a998-f6ca9c6d36e1",
        "author_id": "6e024992-e30b-4922-b624-550d032abdae",
        "user_id": "bauerrenee",
        "content": "You lost me at \"I'm a Trudeau and Liberal Party supporter\""
      },
      {
        "comment_id": "7091197b-838b-4a30-8c62-9e22de978232",
        "author_id": "6e024992-e30b-4922-b624-550d032abdae",
        "user_id": "bauerrenee",
        "content": "And how is your covenant of marriage ruined by the existence of gay marriage? Please elaborate on your persecution and oppression."
      },
      {
        "comment_id": "f92aab0f-fce7-48a1-929a-343ed1e5a561",
        "author_id": "6e024992-e30b-4922-b624-550d032abdae",
        "user_id": "bauerrenee",
        "content": "\"data analysts commenting here are not realistic in thinking just anyone can do a quality analysis with $100, a spreadsheet\"  If you look at the original story that had the spreadsheet linked, you will see that there was no \"quality analysis\"."
      },
      {
        "comment_id": "7aa0793c-83ba-4eca-9649-b5221e874111",
        "author_id": "6e024992-e30b-4922-b624-550d032abdae",
        "user_id": "bauerrenee",
        "content": "There are no words for these senseless acts.. God help us all if we do not learn that evil lurks even in the face of these teenagers. Such violence against their peers, should make everyone take pause. Be safe children, be safe. God says you can be the light of the world."
      },
      {
        "comment_id": "8a947498-6305-4196-99cf-bcfaf2271cd3",
        "author_id": "6e024992-e30b-4922-b624-550d032abdae",
        "user_id": "bauerrenee",
        "content": "Putting Billy Club Blair in charge of decriminalization was the first mistake.  And it was a doozy.  It signalled to everyone involved that the government was not interested in moving forward in a rational way."
      },
      {
        "comment_id": "16e03b2e-80ba-490f-bbdb-c817f8eeb03a",
        "author_id": "6e024992-e30b-4922-b624-550d032abdae",
        "user_id": "bauerrenee",
        "content": "How about the hate preaching Imams in Montreal? Would you advocate them being removed from Canada?"
      },
      {
        "comment_id": "0c644750-0397-4f32-8224-3380422cac68",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "I was a football player and fan for 61 years. I'm done with it and I'm not going back. The true color of the players and league are on full display. Let them play in cuba. God bless America and all is greatness."
      },
      {
        "comment_id": "68edd77a-17ea-4fe4-8f00-0488ba98519c",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "You don't want them in your base? You wouldn't be in power without their support. Maybe you people should have thought this through before you decided and committed to collude with deplorable oligarchs, criminals, psychopaths, fascists and neo-Nazis, and mil-spec PsyOps operators like Mercer's Cambridge Analytica in a conspiracy to brainwash and mislead like pied pipers so many child-like men in this brazen attack upon and subversion of our liberal democracy. You're part of this, Gardner. Every Republican and every Neo-Liberal operator is a part of this corruption. (note: I -will- continue reposting this ALL DAY LONG and expand my efforts if someone wrongfully censors this a second time. Go ahead, make my day.)"
      },
      {
        "comment_id": "f806cc9e-0d73-4764-a4bc-8f6b2af3db9b",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "The legislatures of those states, and of Massachusetts, too, have been under Democratic control for more than half-a-century.\n\nThe Democrats own the problems of fiscal mismanagement.  Their Republican governors can only nibble around the edges and use their vetos.  But even with veto power, as seen recently in Illinois, the legislatures just override the Republican governors' efforts to insert some sanity in the financial affairs."
      },
      {
        "comment_id": "bc6ab15e-244c-4bdc-b448-a341987ce459",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Critical difference - all those other US Presidents where somewhere on the scale of rational predictability, and had their cabinet on board.\n\n1. Don't count on the chain of command, even trained military officers who only know how to obey orders, from following through on everything Trump might order.\n\n2. There is already indication, that most senior people in the US government, will know when to stop before pushing a button."
      },
      {
        "comment_id": "9e9c8a0f-9f38-4ff0-ae6c-6f797774546d",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "R&R, VA claims are handled on an individual basis.  VA claims are based on a disability percentage awarded.  The highest percentage award is at the full percentage. Subsequent and lower disabilities are awarded at a fraction of the disability percentage."
      },
      {
        "comment_id": "4e8f98f3-fe6d-4f9f-a975-b8c11e56ccc7",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Not only is he an insipid, smarmy, narcissistic con man, he has now displayed a complete lack of spinal fortitude.\n\nWhat he said originally was absolutely correct, if politically unwise.  Eventually (sooner rather than later) cleaner, alternate sources of energy, particular electricity, will overtake and render redundant the extraction and conversion of bitumen. \n\nWhen the vise-like grip of the petroleum industry on government policy and media manipulation has been loosened and then broken, we will see such things as liquid thorium nuclear reactors (among others) coming onstream in abundance."
      }
    ]
  },
  {
    "post_id": "bfca9cf6-405c-44b4-b619-9a0baf0b44a7",
    "post_title": "Road wonder sure notice last bar country shake politics learn large certain.",
    "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
    "user_id": "morganwhite",
    "comments": [
      {
        "comment_id": "4fd40aef-1462-4a04-b114-a89d41fd2c63",
        "author_id": "f6bf1dee-ad81-4f8d-9c2d-acd930a29569",
        "user_id": "williamfrancis",
        "content": "My God, that's tragic. :("
      },
      {
        "comment_id": "cecfad11-fecd-4ec3-adcf-577b1f54fa5b",
        "author_id": "f6bf1dee-ad81-4f8d-9c2d-acd930a29569",
        "user_id": "williamfrancis",
        "content": "If he was a ranger at Yellowstone and Glacier National Parks, then he did not work for the Forest Service."
      },
      {
        "comment_id": "3e5f67b7-7595-4c6f-a394-2f214e2b53e5",
        "author_id": "f6bf1dee-ad81-4f8d-9c2d-acd930a29569",
        "user_id": "williamfrancis",
        "content": "All I can say is, what are you thinking Denver? You work for and were put into office by the lawful residents and citizens of Denver."
      },
      {
        "comment_id": "d6035ff6-98af-4cc8-abe6-5b1be929c321",
        "author_id": "f6bf1dee-ad81-4f8d-9c2d-acd930a29569",
        "user_id": "williamfrancis",
        "content": "Maybe they didn't:  You think all the racism started with him? Or was it the constant accusations of racism after 8 years, the constant barrage of liberal media, the obvious bias of the justice department and the IRS. A president that invites racist groups into the white house (BLM), the releasing of black Panthers for threatening people at voting booths, allowing sanctuary cities, repeated terrorist attacks, there are more but my finger is tired."
      },
      {
        "comment_id": "f58887b9-9414-410b-96b4-96def8cacb10",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "The world has passed you by grandpa. I'm sure stadiums being built are only a small portion of the list of things you don't think are needed."
      },
      {
        "comment_id": "64b0da60-0931-4e39-884a-004ff9ab36ba",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "His approval number is at 54%. Where was your boy W at this point in his presidency?\n\nWhere will Trumps be? He comes into office with the lowest approval rating of any president elect ever recorded."
      },
      {
        "comment_id": "3b6ea869-3968-4b1d-906a-db2a914d3f53",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "Perhaps there are times a joke is inappropriate."
      },
      {
        "comment_id": "daa09742-f446-42bb-94dc-023f866d9c9a",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "Unbelievable. Incomprehensible. I am as angry as I am sad. With the anti-terrorism intelligence available, how do these things continue to happen? What the heII motivates people to commit such atrocities?"
      },
      {
        "comment_id": "4ee9d5ff-89a9-4e0c-a2c7-eaec8645765c",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "Re: City Hall.  There was a very large, vocal group of Eugene residents that did not want the former City Hall torn down.  The City Council was not given anywhere near the true costs of the re-building of the building and they were not \"\"kept in the loop\"\" about large increases in the cost of the project.  As I saw it, it was as if the elected members of the City Council did not even exist; I found this to be very disturbing."
      },
      {
        "comment_id": "314edc1f-c732-44ea-a752-2827c365ff00",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "Corporations are only conduits for taxes. It is a cost which they must cover. They either up their prices or reduce costs to keep their margins. By reverting the tax back to the shareholders thru taxing dividends only at the individual level, the IRS gets the money. Shareholders, who many believe have the income to invest( read as \"rich\" are the ones getting taxed. By eliminating most deductions (mortgage interest & taxes, medical) but getting a larger standard deduction will simplify taxes.\n\nAs to your claim of corporate interference, if politicians (who have the real power because of the force of gov't) can't shakedown corporations by giving carve outs to them, that power is reduced to both. As we are seeing today, the GOP establishment does not wish to reduce the size of gov't, only redistribute it to their own cronies. When the Dems return to power, they will reward their cronies.\n\nCorps. can also hire more people (taxpayers) with money not being paid as taxes. \n\nIts a win-win-win."
      },
      {
        "comment_id": "cf629a33-6398-432e-9128-7af3d4192c4b",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "No, here's a better approach you could try, Carpa.  In your comments, use a smaller font that uses less energy."
      },
      {
        "comment_id": "7555d8d0-e887-48db-8bd7-b89c1f05e341",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "I don't claim to have \"discernible expertise in the newspaper business.\"  However, I did stay at a Holiday Inn last night.  \n\nThe real issue, madam, is your pedantic pettiness regarding the use of \"non-standard\" spelling in a newspaper article.  I confronted that pettiness and it made you rather unhappy.  I think the use of one's real identity instills a degree of accountability which is missing with anonymous posts.  Your display of condescension blends very well with your pedantics.  \n\nMy posts have addressed the specifics of the use of language and the spelling of the two words you describe as \"errors.\"  I have pointed out that such usage is interchangeable with your AP standard spelling and is no big deal.  It doesn't alter the meaning of the story in any way.  \n\nIf you're a prof in Oregon's J-school it must be a real joy to be in your class.  Again, in my opinion, your petty pedantics are a bore.  \n\ngood-bye and have a pleasant evening,  Gary Crum"
      },
      {
        "comment_id": "9109eafd-a104-4d5b-9a89-b08b9a386365",
        "author_id": "733aa53b-86d0-4d8b-aa7c-b501f3d06273",
        "user_id": "thomas44",
        "content": "Oh boo hoo Ross. Regardless of what another poster says about me -  I never flag a comment for deletion."
      },
      {
        "comment_id": "afd063d9-8e46-4a82-86c8-eafbf2aedaf6",
        "author_id": "733aa53b-86d0-4d8b-aa7c-b501f3d06273",
        "user_id": "thomas44",
        "content": "To me it sure looks like the Trumpster doesn't want to be president. He wants to be a rockstar for a while and then move on. Can you imagine that guy dealing with the 20 hour a day drudgery the office demands? He's a lightweight. We're going to be stuck with Hillary, a disaster if there ever was one."
      },
      {
        "comment_id": "77bcf46b-2ade-4ab5-aa6f-3c55f1493380",
        "author_id": "733aa53b-86d0-4d8b-aa7c-b501f3d06273",
        "user_id": "thomas44",
        "content": "Dennis, Nothing should ever have to be locked up. Moral decay in society creates the necessity to lock up. We should demand honesty and moral character."
      },
      {
        "comment_id": "606b3121-5cb2-435c-af19-2953a8e866e4",
        "author_id": "733aa53b-86d0-4d8b-aa7c-b501f3d06273",
        "user_id": "thomas44",
        "content": "He (Gardner) said: “I think that the people who are opponents of the bill certainly want this to be about politics and not policy.\"\n\nYeah, Cory... I'm sure John McCain's \"NO\" vote was about \"politics\" /sarc\n\n\n Nothing political about YOUR vote though, is there Cory?    =D  \nPartisan coward."
      },
      {
        "comment_id": "5e796468-bdda-42cc-a7cb-23b8dbbbc1fa",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "Except, if you are taxed to the breaking point, you don't have much left over for investments. That's why high taxes is thievery."
      },
      {
        "comment_id": "428751bf-703d-450e-aee6-df99e2447bdc",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "Gee it look s like the deplorables have a voice...\nThat means 95% of the population has something to cheer for!\nYippee!!!"
      },
      {
        "comment_id": "e64bcdb1-0a06-44d6-a459-a12e6c72c562",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "Busybody"
      },
      {
        "comment_id": "4f6541bd-21e5-4c2e-9eaf-262a6aca885a",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "Well since you didn't answer my question, I'll finish my thought.\n\nThe answer is that those countries are considered more socialist than the US. Some of them have the most socialist systems on the planet. And yet they all have lower debt as a percentage of GDP than the US. So if your concern is debt being passed down to future generations, you might want to look at causes other than our \"socialist\" programs that you dislike."
      }
    ]
  },
  {
    "post_id": "0fb917d7-4ff6-4e2f-8b25-44cd9269ade4",
    "post_title": "Easy bank value among end receive year follow study shake play.",
    "author_id": "71ec8dbd-da75-4f07-8bcb-9cada29d920f",
    "user_id": "crystal72",
    "comments": [
      {
        "comment_id": "9217c4ea-e00f-4a04-a0b8-58105330ac44",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Funny..\n\nTalking about Public Sector being affected.. and ignoring the cost to business entirely."
      },
      {
        "comment_id": "20969ee2-20d9-4a9f-822f-c5824a4a4ee0",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Why has nobody in western media mentioned that Saudi Arabia has room to accommodate a million refugees in an air conditioned tent city outside of Mecca, used for pilgrimage?  It would save  Germany a lot of grief if refugees from Islamic horrors  had gone there. Or is Wahhabi Saudi Arabia better than us and need not dirty it's hands with Muslim refugees it helped create?"
      },
      {
        "comment_id": "9d714ecd-1095-4ae8-855a-979310ed1a45",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "Oh so very sad.  Miracles do happen."
      },
      {
        "comment_id": "a0a987d8-57e9-49e3-a4c0-f43fa74bebc4",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "RR:  Please cite the reference, other than your opinion, that \"90 percent of our states population care in the least.....\". PS:  Don't waste you time.  There is no cite other than your mean spirited opinion."
      },
      {
        "comment_id": "972dd4bf-fbba-4c7f-92ae-4ce4cf2ce3ef",
        "author_id": "7d1f6ebb-0843-42b5-9085-0bb6a276d6ea",
        "user_id": "pwilson",
        "content": "What a novel idea... let Israel decide what Israel wants.... why didn't someone think of this sooner.\n /eyeroll"
      },
      {
        "comment_id": "0740784a-2fb3-47ba-b1ae-e2ba5fe6f16e",
        "author_id": "8b5e1396-deaf-499a-88a8-3b28dc95ba02",
        "user_id": "tranrandy",
        "content": "Does congress require any other gov't agency/entity to pay health care costs 50 years in advance?  \n\nAnd has congress figured out a way to siphon the money out of this account the same way they've stolen from social security?"
      },
      {
        "comment_id": "c82e3a66-3099-44e0-9ab8-f355cbd70097",
        "author_id": "8b5e1396-deaf-499a-88a8-3b28dc95ba02",
        "user_id": "tranrandy",
        "content": "Are there any close in neighborhoods that aren't (a) well-to-do and (b) not provided with biketown locations?     For (a), possibly downtown itself; there is still a little bit of affordable/subsidized housing left there, and if the \"coming soon!(tm)\" subsidies for low-income residents materializes the rental bikes would make a pleasant alternative to walking.\n\nWhy do you care how much money the riders have?"
      },
      {
        "comment_id": "2930dc5b-35e7-474f-8a4f-437530634151",
        "author_id": "8b5e1396-deaf-499a-88a8-3b28dc95ba02",
        "user_id": "tranrandy",
        "content": "Let them eat covfefe after all."
      },
      {
        "comment_id": "522cfe51-ca95-44a0-b6e1-19a0f0560d52",
        "author_id": "8b5e1396-deaf-499a-88a8-3b28dc95ba02",
        "user_id": "tranrandy",
        "content": "Jan Becket decries urban planning in Honolulu but fails to recognize that there has been public discussion about rail for over 30 years before construction even got started. Rail is also on the state long-term General plan. I think it's been there for over 20 years. \n\nWe've even had several ballot issues related to rail. \n\nBut the basic issue is that not enough people vote in this state. So it's difficult to arrive at a consensus on public issues. There is not enough choice in our elections.\n\nWe should try to focus on the problem of poor voter turnout. Publicly financed elections will have more candidates and hence more public interest in voting."
      },
      {
        "comment_id": "d81f3876-e603-4c51-b4c9-2169a9ab6872",
        "author_id": "8b5e1396-deaf-499a-88a8-3b28dc95ba02",
        "user_id": "tranrandy",
        "content": "Climate change expert finds evidence that climate change changes things. When all you have is a hammer,   everything looks like a nail."
      },
      {
        "comment_id": "29e3cd8e-ffc1-4208-8e03-1deba45d0970",
        "author_id": "c8b08257-d827-48ff-81d0-fe933c5e23c6",
        "user_id": "reedkaren",
        "content": "The problem for China with a rogue state like North Korea is that Beijing is a lot closer to Pyongyang than any city in the United States.  And if North Korea is capable of building a missile that can reach Beijing.\n\nSo Beijing is kind of stuck between a rock and a hard place.  On the one hand, they need to prop up a client state that is right on their doorstep.  On the other hand, the client state could do to China what said client state keeps threatening to do to the United States.\n\nThe Great Wall wasn't all that effective in keeping out the Mongol hordes.  It will be even less effective at keeping out North Korean nukes."
      },
      {
        "comment_id": "39635397-2cc9-4983-bb48-d58767aac850",
        "author_id": "c8b08257-d827-48ff-81d0-fe933c5e23c6",
        "user_id": "reedkaren",
        "content": "My my my how quickly they run out of other people's money."
      },
      {
        "comment_id": "5fe88979-6812-4520-8a65-fad6333861d0",
        "author_id": "c8b08257-d827-48ff-81d0-fe933c5e23c6",
        "user_id": "reedkaren",
        "content": "It's not simple economics. In fact, it is estimated that this is costing the U.S. $65 billion annually in lost GDP. And this would not account for the added cost of welfare and crime for those scrambling to make ends meet in the absence of employment. Why would a company rather hire someone without a criminal record? Is it because those people don't commit crimes? Think again. Cops commit crimes all the time, and they enjoy the most comprehensive and exclusionary background check regimes on the planet. \nchrome-extension://oemmndcbldboiebfnladdacbdfmadadm/http://cepr.net/documents/publications/ex-offenders-2010-11.pdf"
      },
      {
        "comment_id": "e39d2ec5-553d-4d9a-b3af-167fe2f30eaa",
        "author_id": "c8b08257-d827-48ff-81d0-fe933c5e23c6",
        "user_id": "reedkaren",
        "content": "The report lose all credibility with \"Under the revamped CPP, working Canadians would contribute 1 per cent more than current rates for the “base” CPP benefit and an additional 4 per cent on newly-covered earnings above that amount. Employers would be required to match these increased contributions.\"\n\nThat means the cost of the pension portion of the total pay package would increase by 8% on newly covered earnings and by 2% for the base pension. \n\nWhat purpose is served by quoting the cost as split - it all comes from the employer."
      },
      {
        "comment_id": "803da2bd-d7aa-4bc6-8a72-1f56c1250a80",
        "author_id": "c8b08257-d827-48ff-81d0-fe933c5e23c6",
        "user_id": "reedkaren",
        "content": "There's my big fella! Still, only posting around 7:30 this morning? Must have had a sleep in! I bet you slept well!"
      },
      {
        "comment_id": "62e38c90-bb51-4762-a7c6-d171fbcf8a13",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "I believe you’re describing the Episcopal Church.  The first problem that you encounter is that, like the Episcopal Church or RCWP, the result would not be in communion with the “other 22 Catholic Rites” none of which ordain women and all of which adhere to the Church’s teaching on the impossibility of doing so."
      },
      {
        "comment_id": "0a766813-7191-43bd-a4c8-2a9ce2debd2f",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "Interesting thoughts. However, another issue in the huge increase in the national debt, an issue which also rings a bell for the millennials."
      },
      {
        "comment_id": "70b7344c-60bd-4c32-8ddf-7d1b0692a32a",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "I am pleased with these prelates' reactions, but I am even more curious as to how Abps. Chaput, Gomez and Kurtz handled the good news. ;)"
      },
      {
        "comment_id": "f5d9bfeb-6739-4b6d-9091-69f8746decc7",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "That's fine.  Maybe we can just agree to disagree."
      },
      {
        "comment_id": "bc212872-e6e1-427c-a744-8fa2a47804e1",
        "author_id": "de917554-493c-456d-a58d-d098dcce8467",
        "user_id": "wholden",
        "content": "The G&M has a long tradition of opposing police protection and supporting organized crime. No way the Globe will look at police-officers-as-shooting-victims in a sympathetic way.  These are the values the Globe brings to the table."
      }
    ]
  },
  {
    "post_id": "df75c710-e1fa-4919-96d7-d2aa30256867",
    "post_title": "Night four white shake unit front technology.",
    "author_id": "e7d2b7be-345b-4d44-98b3-eff950d0ef84",
    "user_id": "robertburke",
    "comments": [
      {
        "comment_id": "d226e7eb-a814-4b4e-82bb-fa6254c98d83",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "I do not think that word means what you think it means."
      },
      {
        "comment_id": "c1804f86-f451-4739-8e13-d3c9288a0979",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "From the article:    'Nothing in Canada matches Fair Oaks Farms, in Fair Oaks, Ind. The operation has 32,000 cows and produces enough milk to supply the city of Chicago.'\n*****************\nThat's 32,000 cows suffering from health issues such as mastitis, foot problems \n and injection site reactions - painful side effects of bovine growth hormone that are well documented in numerous studies.  \nHow spectacularly obscene.\n\nThe Canadian government has been undermining small farmers for many decades, through Conservative and Liberal governments alike - further proof (as if any was needed) that big business and government are bed buddies.  \n\nBefore long, 99.9% of all farming will be corporate.  Mission accomplished One Percenters!!!"
      },
      {
        "comment_id": "0e564dda-b9d4-44f7-979d-131f94180b99",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Not to late,  legislator's can still require the audit before approving future funding.  Hopefully they come to their senses and force the city and HART to do the audit.  Find out why costs keep going up."
      },
      {
        "comment_id": "535ce46c-962f-4a23-bb33-e73755e7e4cc",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Yep. Stupid law. One of many.  Encourages armed idiots with an imperfect understanding of the law to use guns, in this case p anywhere a vehicle can conceivably be: Amusement parks, parades, shopping centers, day care, you name, huge potential for injury and death.  Trumpian in scope and capacity for harm."
      },
      {
        "comment_id": "381359be-1b71-4bf3-96c3-e79a4c97f518",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "I don't give a damn if our government charged him with making bombs...it's been shown that it happened."
      },
      {
        "comment_id": "f2a77a49-8348-4004-ae85-b7dbd1be669e",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "\"The City garnered public support for rail by under-estimating construction costs, over-estimating ridership, virtually ignoring the inevitability of budget-busting operating costs, and outright lying about rail’s likely impact on energy use, visual environment, sound levels, burial sites and, most importantly, traffic congestion.\n\nThe City then pursued a morally corrupt strategy of spending so much money, signing so many contracts, and pouring so much concrete that the project would be past a point of no return by the time the public “got it.”\"\n\nBlack Coffee: is any of the above not true? Is rail not five years and counting behind schedule? Is rail not $8 billion over budget and counting from the original promise of $2.7 billion for 34 miles made by the Mufster? Does the city not have no plan to fund operations and maintenance, much less a new power  plant? \n\nWho is the propagandist here? Your post makes no sense. Rail is a disaster of epic proportions - there is no denying that."
      },
      {
        "comment_id": "5ddb4e42-6f7e-417a-a16c-fab22a58af41",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Typical socialists trying to convince people black is white.  Rent controls will reduce the supply.  Proven time and time again.  Yet the unwashed living paycheck to paycheck can't figure it out.  In a few years there won't be any place to live and they will have went from a bad situation to a terrible one."
      },
      {
        "comment_id": "2ec21091-9b53-4cfa-b0eb-a1fda67c76b2",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "In resolving the legal issues involved in these cases, I hope the focus is kept on the victims first and foremost.  The chances for that are greater with religious orders than it is with dioceses, as bishops have tended to talk out of both sides of their mouths.  In any event, the survivors victims and their families should be and stay vigilant in making sure the Crosier's keep their promises.  May God bless all involved.  Another example of how those who are called to serve the Lord, also damage that calling so fatally.  I am ashamed of my brother religious."
      },
      {
        "comment_id": "7d5f27ee-41c3-4cf5-9164-869458a012b6",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Very sad. Van is one of the hardest working guys around as anyone in the restaurant business will tell you."
      },
      {
        "comment_id": "80b2fcb8-2e1b-4cf9-a47f-9e71f2b575f5",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Wow, more scum on the swamp that needs to be scraped off, just to get to the swamp. Trump keeps adding layers"
      },
      {
        "comment_id": "a5f023b5-3352-409e-b913-a163fe5f7910",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Ah, there's the problem.\nEveryone knows;  Guinness is GOOD for you!"
      },
      {
        "comment_id": "b5aebcb7-5c6a-4dd4-9bc7-c781f82ae3b4",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "What an embarrassment to the State of Oregon.\nTime for term limits!"
      },
      {
        "comment_id": "2192d73a-fe27-40fc-87e4-ac15710d9c90",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Some students, with more severe disabilities, are more set apart. Those with significant cognitive disabilities might be in a life skills class (although they still take electives and lunch with other students), and those with severe emotional disturbances or who have proven to be repeatedly violent may be put at Whaley or other specialized programs. But federal law requires the least restrictive environment, and for most kids who have relatively minor disabilities, they are mainstreamed into a more inclusive environment. Which is great for many but not every student. To move a student to a more restrictive environment is a very cumbersome process, particularly if the parent objects. \n\nOther districts use more self contained classes but ASD is big on inclusion. For many that's good, but it isn't beneficial to everyone who has a disability or sometimes even other students. It just depends."
      },
      {
        "comment_id": "54bdf536-0a10-4f1c-ba83-4cf61977e572",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "All Catholics are Cafeteria Catholics -- well, Tridentinus says he isn't, but that is open to debate. Liberal Catholics are prepared to admit it; conservative Catholics generally aren't."
      },
      {
        "comment_id": "205547c1-cff2-4af8-9785-779f76a9dc98",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "She/he can train Harvard students how to be traitors to their country. Obama must be so proud."
      },
      {
        "comment_id": "960abbc1-682b-40cb-b5b3-638c80a6202f",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Read the study conducted by the government, revealed only via an access to information request.  Mass immigration is failing in jobs and housing, among a myriad of other areas, and thereby failing Canadians."
      },
      {
        "comment_id": "697a9eb7-30f7-4de3-9737-18dc44931839",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Current Federal Immigration Law prohibits immigration of any person who intends to practice polygamy, and permits a President in his sole discretion to prohibit any person or class of persons from entry...it was used by President Carter, in fact.  \n\nIf Trump's \"notion\" meets current Federal by prohibiting a class composed of recent Syrian emigres it would be legal."
      },
      {
        "comment_id": "59a1d06e-128e-435a-9458-def16837699b",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "How much does it cost to prosecute a hundred radical people with no solutions, just lots of anger towards those that don't share the wealth with the protestors and us. If our wealth was distributed equitably, those radical anti growth and anti export fools might not be so angry. The problem is too much tax, not enough freedom and opportunity  created that angry crowd left to fend for themselves in dead end jobs because of neo liberalism left the angry anti-pipeline folks with little other than the short end of the stick. Mulroney sold out our manufacturing sector and burdened us with GST.  The answer is simple, American oil has been against Canadian pipelines and funds groups like those protesting in Ottawa. It has nothing to do with not enough carbon tax. Protestors should be protesting the GST, the real problem facing ordinary folks. If the GST is so great, why doesn't the USA have one? Because it is grossly unfair. After tax income is ours, not theirs to poach. GST kills jobs here."
      },
      {
        "comment_id": "1f338de9-7502-4674-be90-f58b7f749e6d",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Not surprising; the \"Yes on Prop 8\" folk ran a terrible campaign, full of lies, half-truths and misinformation.  Their FB page's Admin was fond of insults and nasty comments towards people seeking additional information.  The radio/tv/print ads were misleading at best.  And they distilled all of Prop 8 down to one issue - their bottom line, while forgetting that the revised Muni ordinance also greatly increases the availability of accessible cabs for people with disabilities, increases penalties for unlicensed drivers, and requires permit owners to operate a minimum number of hours per year.\n\nAlso:  Yellow Cab and Checker are currently charging below the max threshold they're allowed to by ordinance ($3/ flag, $3/mile). The Yes on Prop 8 Admin  (who is probably closely connected to the ATPOA) made some veiled threats that both dispatch companies would increase to the max allowed fare if their repeal efforts failed.  It works out to 10-20% increase if they do so."
      },
      {
        "comment_id": "95e76472-84fd-4b03-b764-5f94b055e4ec",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Horse love is an incurable affliction.  It primarily afflicts women.  When diagnosed, a large \"H\" should be tattooed on the girl's forehead to warn prospective grooms.\n\nIt is a proven fact that one woman and one horse can spend more money than any two people can make at any legal occupation.   At least if they want to eat anything besides top ramen or  macaroni and cheese."
      }
    ]
  },
  {
    "post_id": "2325be35-06f5-4333-b3ef-c9773ad12ef4",
    "post_title": "Onto stuff weight skin analysis hard arrive cost alone middle act drive matter.",
    "author_id": "a1bd2dab-3239-41d8-a4a0-c0c7799fd448",
    "user_id": "jessicawright",
    "comments": [
      {
        "comment_id": "a818d30d-5ceb-47fc-94b9-7b11e44f91e9",
        "author_id": "a2982b1c-c34b-4413-99b9-1b1f739548f4",
        "user_id": "jacksonjared",
        "content": "This is hilarious (as in Hillary). There is no chance that Trudeau thinks for himself. And to cover up his illegal and immoral behaviour, he calls it \"lobbying\" instead of fundraising? Does he think Canadians are that stupid?"
      },
      {
        "comment_id": "1cdb0d33-afe2-4800-b757-6af6956ba475",
        "author_id": "a2982b1c-c34b-4413-99b9-1b1f739548f4",
        "user_id": "jacksonjared",
        "content": "Wasn't that server in the Trump Tower which was connected directly to the Russian Alpha Bank also connected to DeVos's business, Spectrum Health?"
      },
      {
        "comment_id": "379380f6-364b-40be-a9e8-d184ce7f7719",
        "author_id": "a2982b1c-c34b-4413-99b9-1b1f739548f4",
        "user_id": "jacksonjared",
        "content": "Had he tweeted the same salute toward anyone in the Trump administration, Fox News, or Beitbart he would have been hailed as a free speech hero, and given a promotion and his own show."
      },
      {
        "comment_id": "9294779e-91fa-4917-afb9-355f9bd9a69d",
        "author_id": "a2982b1c-c34b-4413-99b9-1b1f739548f4",
        "user_id": "jacksonjared",
        "content": "Hahahahah and 3 likes to boot .... \n\nSimply put you are wrong.  There are 2 types of tax credits.  \"refundable\" and \"non refundable\"\nIn the case of a non refundable tax credit, you can take the credit up until your liability is 0 in which case you have maxed it out, no matter the amount.  \n\nA refundable tax credit will be refundable to you.   Meaning if your tax liability is 0 and you have additional tax credit that money is refunded to you ... (meaning you get money \"back\" that  you never paid.  \n\nPlease educate yourself before correcting others.\n  \nfor more information please go to \n\nhttps://www.irs.com/articles/refundable-vs-non-refundable-tax-credits"
      },
      {
        "comment_id": "6d0aa1ab-3654-4e89-9963-0115d2badb1f",
        "author_id": "a2982b1c-c34b-4413-99b9-1b1f739548f4",
        "user_id": "jacksonjared",
        "content": "Hmmm,... you didn't refute that billionaires run this country, and obviously their model is working stupendously well for them, so I dunno, maybe educate yourself about their model?"
      },
      {
        "comment_id": "684a3e8a-c20e-4b9c-ad15-dcb0665f7987",
        "author_id": "a2982b1c-c34b-4413-99b9-1b1f739548f4",
        "user_id": "jacksonjared",
        "content": "Why would we want to deny Mexico the benefit of these Dreamers?  After all, that's where 90% of them come from."
      },
      {
        "comment_id": "7210c31e-5d5d-459f-9767-9408049ffb18",
        "author_id": "bc4073be-eb25-46d6-b47a-6e434b08e5e0",
        "user_id": "brian26",
        "content": "Investigative journalism or central banker globalist banking shill mr carl bernstein ?   Your rich on bailout and quantitative easing.   Talk about white privilege.  What about semite privilege ?   Now we got Kushner, Bernstein, bloomberg, zuckerberg, feinstein, Schumer....and the list goes on.   They are even bringing out semite Ted Koppel.   The so call press took off air anyone that does not agree like Glen Beck, O'Reilly on fox they called a sexist and O'Reilly is done.  Shawn hannety the globalists DEMOCRATS PRESS want gone next.   Only one news owned by about six rich families ?   That is news ?"
      },
      {
        "comment_id": "94404636-9fe5-43ce-be5f-863e48c3928f",
        "author_id": "bc4073be-eb25-46d6-b47a-6e434b08e5e0",
        "user_id": "brian26",
        "content": "He is playing to his base and is just as guilty as they are.  trump carried the birther issue up to the time he was elected and never apologized for it, he simply stated that Mr. Obama was born in the USA, period.  You cannot legislate these racist views but from the example set by our leader and the tone they set, keeps the racists in check.  You can legislate behavior by make rules/laws restricting certain bad behavior.  trump's behavior has given these racist the green light."
      },
      {
        "comment_id": "4d07aeb9-65a5-41ef-b247-de28f325d361",
        "author_id": "bc4073be-eb25-46d6-b47a-6e434b08e5e0",
        "user_id": "brian26",
        "content": "You defended Burke's blatant homophobia, and you defended the bigots who harassed those people in the Church. And you defended Trump and his anti-Muslim bigotry."
      },
      {
        "comment_id": "77c8ea76-885f-46b6-a635-7135feb98d0c",
        "author_id": "bc4073be-eb25-46d6-b47a-6e434b08e5e0",
        "user_id": "brian26",
        "content": "He didn't mention MSM, you did.  For those in the industry, the Canadian sale of Uranium One to the Russian firm has been known a long time, just like Lockheed's contract extension at Sandia. Neither transaction affected national security, but both were corrupt as hell."
      },
      {
        "comment_id": "6407b452-f15a-4bbf-aa04-4bcb7c844fd9",
        "author_id": "bc4073be-eb25-46d6-b47a-6e434b08e5e0",
        "user_id": "brian26",
        "content": "Lookin fwd to not seeing these posts for 3  plus weeks starting tomorrow.   Business/holiday combo that one really could only dream of..   By the time I get back, the Laughs will be in season and another Nation losing team will take left stage....."
      },
      {
        "comment_id": "4299329b-5090-41a0-9fc4-9384d61f4d8f",
        "author_id": "bc4073be-eb25-46d6-b47a-6e434b08e5e0",
        "user_id": "brian26",
        "content": "The author is a scribe for a Catholic lobby group likely interested in wasting land on elaborate bone yards for his tribe of  faith-afflicted dead. Fine with me. I don't live nearby. If I did, I would object, regardless of my particular metaphysical delusions. Cemeteries are memorials to barbarity and ignorance. They also attract ghouls."
      },
      {
        "comment_id": "ef6a93b3-24cf-4dd6-b4e6-189fcdf4c9db",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "I've always had fixed feelings about the Iditarod. After almost 50 years in Alaska, I've been aware of many, many issues. I was also raised by a cattleman who handled cattle totally differently from his neighbors. He hated rodeos and used to say: \"Dammit, if I want to see folks beat up on cows, I'll just go to the neighbors, and they won't charge me for a ticket.\" \n\nMy Dad believed in animal rights without using the word.\n\nOn the other hand, the uber-elitism, bad manners, hyperbole and downright lying of PETA makes me think that they are bad guys. I wouldn't put it past PETA to have set this up. They're sure as hell milking it.\n\nAnd then there's the Iditarod Trail Committee. What a bunch of bozos! I believe that most mushers are in fact supporters of animal rights. Go Dallas."
      },
      {
        "comment_id": "c715b09c-8188-4d58-bd75-feb66eb1d0ab",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "OH MY ACTUAL FUCK OKAY LETS GET THIS STRAIGHT RIGHT FUCKING NOW JEFF DIDN'T DO ANYTHING THE VIDEOS AND FACEBOOK LIVE VIDEOS FUCKING PROVED IT!!!!! THE OTHER GUY IDK WHO HE IS BUT JEFF DID NOTHING!! THESE POLICE OFFICERS CAN EAT DICKS!"
      },
      {
        "comment_id": "7ea9e266-edcb-4d1f-97ea-c11b0fc879d1",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "It might have worked, however it's unfortunate that the environmental lobby and folks like Catherine McKenna have stubbornly, smugly and pigheadedly refused to compromise on any issues, despite the fact that Alberta tried to meet this lobby half way by agreeing to implement carbon taxes.  \n\nThe fact that this group seems to prefer oil shipped up the St. Lawrence from jurisdictions with less stringent environmental regulations is also something that smacks of hypocrisy and lack of common sense.  As Rachel Notley's government is ushered out, I wonder if these twits will regret the lost opportunity to compromise with a government that seemed willing to meet them half way.  Probably not... which is why I remain completely disgusted with the lot of them."
      },
      {
        "comment_id": "5f9ea5e2-cac6-4f12-8c36-b739d6456d41",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "I don't want to speak for Violet, but it seems HER point is that Da Vinci was very attentive to the gospel narratives of the Last Supper."
      },
      {
        "comment_id": "6bef47dc-e201-4acb-b8a5-30e365ef8859",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "Uh, this is not accurate.  There are often large crowds in Chitina, the fishing is sporadic, and access is far more challenging and dangerous.  If you're going to advertise this small fishery to the largest population in the state, at least prepare them for the reality of the trip."
      },
      {
        "comment_id": "ce626552-a8f8-4818-9ee8-1e8f1980f1c5",
        "author_id": "d0feea1a-29af-4db4-adf0-0f8b732b9a7a",
        "user_id": "andersonamber",
        "content": "What is hard for me to understand is why the union wants to short circuit the process.  Of course they are concerned about their members.  But they have no direct involvement in the investigation and reporting process.\n\nThis is not the first high-rise fire.  There are no special circumstances that warrant breaking procedure."
      }
    ]
  },
  {
    "post_id": "d7ca020d-063d-4200-ab7a-d76b3bfd2564",
    "post_title": "Human can tax daughter couple human author apply score pressure quickly body.",
    "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
    "user_id": "rstark",
    "comments": [
      {
        "comment_id": "329e273f-31c5-4a16-9dc8-6915d5eab073",
        "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
        "user_id": "fgraham",
        "content": "What is wrong with that?  The President should be given all of the facts.  Obviously his his staff failed because he did not know the slain  soldier's or wife's name.  Just helping the President out.  Needs a lot of help."
      },
      {
        "comment_id": "f5b2f865-339d-4a95-a0f5-24fa0e5694be",
        "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
        "user_id": "fgraham",
        "content": "I loved watching the Senators face.\nHe looked like he truly appreciated the moment for what it was."
      },
      {
        "comment_id": "28a14f75-2587-4815-8f1d-65cf6a66bc0d",
        "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
        "user_id": "fgraham",
        "content": "The goofs who pay to much for too little in their electrobuggies will lose big time."
      },
      {
        "comment_id": "0b9db201-37c4-4909-bddd-6203c223caff",
        "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
        "user_id": "fgraham",
        "content": "One other thought re the 18 year old who is sending nude pictures. If the LW really thinks she doesn't understand the ramifications of what she is doing - talk to her directly. Don't go to her mom. She isn't 2 yrs old. she is 18 and an adult. Talk to her directly if you have an issue."
      },
      {
        "comment_id": "7bd301df-129f-46d6-a23b-0a8d9b708a42",
        "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
        "user_id": "fgraham",
        "content": "I myself miss being called a \"commie\".\n\n\"Leftie Loser\" was also a favourite..........Maybe there will be a resurgence?"
      },
      {
        "comment_id": "dfd52232-e638-489e-b28b-ee8d5563436a",
        "author_id": "e65ec6e7-8f5a-4dd6-8373-dda0e791cda1",
        "user_id": "fgraham",
        "content": "Mmm--Japan got two A-bombs because they attacked Pearl Harbour--Abe should have apologized then we can move on and focus on the real enemy in 2016- Chinese aggression."
      },
      {
        "comment_id": "74692b77-57ef-4093-9517-fc057f0336f2",
        "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
        "user_id": "rstark",
        "content": "No requirement for restrooms at stations and especially not on rail. \nSan Diego trolley does not have any public restrooms which drastically reduces monthly O&M costs, saving taxpayers big time. Riders deal with it.\nAre you say Nei riders do not know how to plan restroom use prior to going on rail? Would not surprise me. Nei is so backwards."
      },
      {
        "comment_id": "f517bc6b-b4fc-4c84-a7c4-d209ca0d7b1c",
        "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
        "user_id": "rstark",
        "content": "For good reasons we don't tax wealth.  We tax income and investment gains (housing excluded, of course).  What you keep after tax is yours to do what you wish with.  What you keep has already been taxed.\n\nAnd people who live in houses that appreciate in value pay increasing amounts of property tax as taxes are based on property values.  There are problems with how appraised values are reached, and with certain places where property tax rates are low....*ahem Toronto*...., but it is simply false to assert that these people don't pay taxes.  They pay them and they pay more as their home is worth more."
      },
      {
        "comment_id": "2820503b-6d1b-4b1f-8dc8-0eb7e04aa887",
        "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
        "user_id": "rstark",
        "content": "Taking on debt so that the .01%ers can avoid paying taxes is a completely different situation than investing in infrastructure so that jobs and economic activity gets dispersed. Paradox of thrift is still a valid concept. Take a yuuuge mortgage to flip a house is different that someone buying a house to live in. House flippers don't need washing machines and furnishings- which generate secondary spending. And no, this is not trickle down economics. That is a different thing.\n\nWe had the business leaders running the US Treasury for too long. It didn't end well for the average family or middle class worker. Watch the \"big short\" or \"Capitalism not a love story\".  Rich simple got richer. \n\nIf you are going to incur debt to increase GDP, put it in the hands of people who will spend all of it within local economies on tangible goods and services."
      },
      {
        "comment_id": "0a94bbfc-1705-4427-a165-2c8e93fea1de",
        "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
        "user_id": "rstark",
        "content": "Jobs, development and tax revenue for Alaska and Bristol Bay - It is a good thing!"
      },
      {
        "comment_id": "d35aa417-d65e-47c9-ade7-434232f2c93f",
        "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
        "user_id": "rstark",
        "content": "I give the bishops credit for sending a strong message to President-Elect Trump. Now they may be called upon to back up that symbolism with real action if it's ever required. I pray they are up to the task."
      },
      {
        "comment_id": "87703945-7752-4034-a9b9-eb4062137883",
        "author_id": "6a8f1f1d-7b40-4dbb-a9b5-2d5421bc1e5e",
        "user_id": "rstark",
        "content": "We should be dealing with real l problems like jobs not stupid statues."
      },
      {
        "comment_id": "4f1da17c-0aff-4bb4-88e7-5f9a57c19bf1",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Can someone explain why people in rural Canada shouldn't do their part too?"
      },
      {
        "comment_id": "1e2e23c0-e31f-4482-aac7-8285c181f943",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Oh, he is."
      },
      {
        "comment_id": "066df3f4-5e20-46d3-98fd-d0a4576bb8d6",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Poor bubba. So pleased you aren't over-reacting and never use hyperbole.\n\nBTW, it IS 2017. I realize you'd prefer to live in your own dream-world, but the rest of us are quite happy without living our lives in fear. Try it - you may come to like it."
      },
      {
        "comment_id": "a7d030c9-8e1f-4cc1-9697-d7bb390ded23",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "When I started work for the State of Oregon in 1998, part of the incoming indoctrination was a presentation about computers.  After discussing the Oregon Public Records Law, we were all told:  \"Do not put anything on the computer that you don't want to see above the fold in the Oregonian.\"  (There were still big thick newspapers back then.) \n\nWhen I was first granted a Security Clearance, part of the three-hour interview and briefing was to point out all the bad things that could happen to my country and to me personally if I revealed Classified information.  \n\nEveryone involved at the DNC (two Congresswomen in charge), Podesta, and Hillary have all had the same briefings or the equivalent.  \n\nArrogance, hubris and stupidity were the main ingredients for this bit of political theater."
      },
      {
        "comment_id": "bea3a1fa-a0d0-4aa8-a65f-6677f159fd5f",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "www.wikileaks.org is the best website of my life. GROW UP!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Words matter. Sentences matter. Details matter. J for Justice. Gracias. Thank You. ARI for ARI and ARIGATO"
      },
      {
        "comment_id": "cf24d60c-43bd-4493-abc2-1a94435cd92c",
        "author_id": "95563f65-3903-4bd8-bd6f-00af7fef50dd",
        "user_id": "sherridavis",
        "content": "Cleaning house never gets done, the way Eugene's government is set-up.  This charter amendment would change that."
      }
    ]
  },
  {
    "post_id": "054540a7-bb95-490c-b487-8e4d160135a1",
    "post_title": "Wife huge different nation tend behind.",
    "author_id": "2bd6bea2-5f19-43e8-9970-f657d75f6783",
    "user_id": "julia21",
    "comments": [
      {
        "comment_id": "0529c935-71f3-47fe-b409-4ae95bdedbcf",
        "author_id": "c751bdd0-fb7b-49d3-bd19-d7c6ecd04072",
        "user_id": "curtismartinez",
        "content": "... nepotism is rife in politics ... Republicans are filthy w it all the way to the top"
      },
      {
        "comment_id": "3a436772-f7ea-44fc-9db6-38b6b490f295",
        "author_id": "c751bdd0-fb7b-49d3-bd19-d7c6ecd04072",
        "user_id": "curtismartinez",
        "content": "There have been hurricanes before and there will be hurricanes in the future.  People know this.  It's a business risk for anyplace in the Caribbean.  \n\n Some islands have had serious damage but with help and insurance they will rebuild.  In fact the silver lining is that there will be lots of economic activity because of the rebuilding process, plus they build improved infrastructure .  \n\nBut to suggest this is the death knell for tourism down there is laughable.  Much of the Caribbean or the gulf was not touched.  Florida will quickly recover."
      },
      {
        "comment_id": "29c4416c-24e6-446b-b57b-877e88cdf456",
        "author_id": "c751bdd0-fb7b-49d3-bd19-d7c6ecd04072",
        "user_id": "curtismartinez",
        "content": "Who cares."
      },
      {
        "comment_id": "55e8e2ba-a123-45c4-b936-38ed90280fad",
        "author_id": "c751bdd0-fb7b-49d3-bd19-d7c6ecd04072",
        "user_id": "curtismartinez",
        "content": "Very well said. It is about time that we acknowledged that immigrants, whether visible minority or not have the same concerns as all members of society and that their opinions are varied and that one party or ideology does not speak for all newcomers to Canada."
      },
      {
        "comment_id": "3cec1a6f-b752-4c18-9416-7cef6710872f",
        "author_id": "c751bdd0-fb7b-49d3-bd19-d7c6ecd04072",
        "user_id": "curtismartinez",
        "content": "I think you nailed it...\nTrump obsession ++\nA recent Twitter comment about \"Real Housewives of TO\" (visiting Muskoka);\n.\n\"There goes our property values\"....\nDeep thoughts indeed..."
      },
      {
        "comment_id": "75856c22-1ade-494f-8a75-6b2fbe2ea9cc",
        "author_id": "c751bdd0-fb7b-49d3-bd19-d7c6ecd04072",
        "user_id": "curtismartinez",
        "content": "Have you ever thought to yourself that perhaps his administration looked not only at American statistics regarding terrorism but also at European statistics?"
      },
      {
        "comment_id": "f5556249-94e6-486f-baee-6cd45aa47b32",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Wow, nothing like comparing a wedding to a house sale, as if women haven't been treated like property enough. Come on, brides, clean up those windows--he might look at another option! Sheesh."
      },
      {
        "comment_id": "20c28880-016a-4653-8c9e-73182bf35a01",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Guns don't kill people, people with guns kill people."
      },
      {
        "comment_id": "b9645722-654c-4460-a470-68874f40e63a",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Why was he a \"lowlife\"?  The fact that this happened in Nanakuli and he was from Waianae?  Granted he was probably in the wrong but this hardly makes him a low life.  Who knows maybe his gas pedal stuck?  Fact remains someone has died who probably had people who loved him.  You should never rejoice at someone's loss.  This may be you someday."
      },
      {
        "comment_id": "3b3592ee-5a83-47ab-a554-af7f02e1b022",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Did you listen to the call?  Listen first post second.\nhttp://dailycaller.com/2017/10/20/gold-star-widow-releases-trumps-call-after-husband-was-killed-in-afghanistan/"
      },
      {
        "comment_id": "c41f0a7a-716e-4900-bb66-22f42fce9a27",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "The minimum wage changes don’t affect the folks in this survey. They affect the little coffee shop they stop in at on the way to work, or the restaurant they have lunch at.\nFishin’ in the wrong hole."
      },
      {
        "comment_id": "d7eddf17-6bc9-4bf1-bb36-77d74b77b1ba",
        "author_id": "431d2b8d-95a5-46f1-93b1-c08a73575134",
        "user_id": "jonesmichael",
        "content": "Liberals cheating would put you in a coma ?"
      },
      {
        "comment_id": "38a10472-c53d-4805-b4f3-22e7fb694abd",
        "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
        "user_id": "njohnson",
        "content": "We cannot even trade beer freely across provincial boundaries and these fools talk about pot."
      },
      {
        "comment_id": "a700a2fb-0457-45da-860b-9493df802818",
        "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
        "user_id": "njohnson",
        "content": "Probably? It's exactly what it is."
      },
      {
        "comment_id": "5087b861-0851-4f71-8a51-21be15399a71",
        "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
        "user_id": "njohnson",
        "content": "I bet she wants to bomb affordable housing units, too."
      },
      {
        "comment_id": "982fd2ae-27d7-445e-b31f-360be324181e",
        "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
        "user_id": "njohnson",
        "content": "You have a lack of arithmetic and physics. 66% of the bullets hit their mark. 34% did not. Those bullets went somewhere."
      },
      {
        "comment_id": "61ba228d-42b6-45f7-a3f8-ad41f19377ce",
        "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
        "user_id": "njohnson",
        "content": "It seems to have become all too common that every time a POTUS goes anywhere in response to some natural or man-made disaster, those of the \"other political party\" bashes the \"political stunt.\"\n-\nThey did it when Obama was POTUS. They're doing it now with Trump. And they would have done it if Hillary was POTUS."
      },
      {
        "comment_id": "59500def-2833-43c7-b683-56f5fc93772c",
        "author_id": "c6f93171-a5c2-4d03-aacd-94383b1c1c86",
        "user_id": "njohnson",
        "content": "Exactly.  I'm not holding my breath for cooperation, common sense or decency from any side, but especially today's GOP."
      }
    ]
  },
  {
    "post_id": "741195f3-bc60-4a2d-8997-c2e4de9f5914",
    "post_title": "He every place nor head include.",
    "author_id": "39263db8-cb96-429a-93d4-ead46d2aea7f",
    "user_id": "russelljustin",
    "comments": [
      {
        "comment_id": "e4b7bf90-76ab-4e37-82c7-a7004a63705d",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "$131/day seems more than generous to me, having been sent internationally on a $75/day allowance! While I recognise that cabin staff do not always get to go out to restaurants, and have to pay more expensive room-service rates, asking for $170/day is taking the piss, in my opinion!\n\nThe complaints that the amount has not been updated in years are also disingenuous, as dollar inflation is nowhere near Rand inflation levels, making it unnecessary to update as frequently!"
      },
      {
        "comment_id": "b0e54e52-ab2d-4e97-bd71-f30c17642f1d",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "It's not your job to fix this.  The harder your sister tries, the more pathetic she will appear.  She's looking to make you upset...don't react at all.  Don't overshare sensitive and personal information with her."
      },
      {
        "comment_id": "81a6a1b8-9fbe-4e15-9451-04e75d39db35",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Dead is dead. Danger is danger; when people who can't deal with it try to do dangerous jobs they put other people at risk. To be fair, modern police are probably better trained and more honest than in any era of the past, but by and large, they're not up to the job. Weapons technology has upped the ante drastically."
      },
      {
        "comment_id": "2c10f908-8d50-4122-98a5-e7a53c3d03e0",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Layla, how do you feel about sticking to the subject of the article at hand?"
      },
      {
        "comment_id": "7ebe2184-798b-4293-bf86-d5011e1e3db9",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "Greetings...Ms Calista should stick to writing Neo Con children's books \"Pilgrims Pride\"  and keep an eye on her promiscuous Newt!"
      },
      {
        "comment_id": "8831ed94-2ba3-4e8c-8657-d7ddfa7a7d4f",
        "author_id": "45e00dec-1bf6-44ae-80e9-e13b95cf946b",
        "user_id": "jessicasoto",
        "content": "I think that they actually said open to transparents."
      },
      {
        "comment_id": "9383d2ae-3555-4612-a31d-baaf33691b6d",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "It is not polite to brag so openly."
      },
      {
        "comment_id": "304e3d69-7c45-4720-ba28-7463efc327bf",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "OK, I was spelling it British only to PO a couple of nigglers.  Ha Ha"
      },
      {
        "comment_id": "33622098-0034-4f6e-9afb-1d1398b8241b",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "I remember in early 1980's visiting Dr. Becks home with his wife, Virginia, a friend. It was one of the old homes with acreage on the beach in Kahala near the Wai'alae Beach Park. There was a rental apt. over the garage and a separate rental house or two on the grounds. They were preparing to sell, an offer they couldn't resist. I suppose to Japanese. Later I came back trying to find this charming residence from the ocean side. It no longer existed, just a modern mansion. Actually it isn't just the charm of a once Kahala that is gone, but Oahu as well."
      },
      {
        "comment_id": "68afdfea-bddf-40d9-9125-35e4d2f2c49c",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "Abandoning US citizens is not an option. It is also the actions of a real life anti-Christian. This is on the GOP in congress at this point, they could have impeached him with just Manafort."
      },
      {
        "comment_id": "01c47bdf-4a2a-406e-9542-c9a7658deb7b",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "This article is all about common sense & the nature of corporate groups. Then stir in foreign corporate mentality & it is clear that this controversy should never have matured to the point it now occupies. We simply cannot allow any mining of this nature to take place anyplace as sensitive as the headwaters of Bristol Bay."
      },
      {
        "comment_id": "b56988d4-38f6-4b21-bfca-d87dba1d43dc",
        "author_id": "4585ca6e-c1cf-4d77-848f-4c0510e7f53a",
        "user_id": "ginasantos",
        "content": "This is from The Daily Beast piece on the lawsuit and Blaine's resignation \n\n\"While it is unethical for a lawyer to pay a fee or give something of value in exchange or as a reward for a referral for legal services, it is neither illegal nor unethical for an attorney to make a donations to a non-profit, and it’s not yet clear in this case which occurred, legal experts told The Daily Beast.\nIf a court finds that the lawyers did violate the ethics rule, the attorney in question could face sanctions from his state’s high court, said Jim Grogan, deputy administrator and chief counsel of the Illinois Supreme Court’s Attorney Registration & Disciplinary Commission. “Anywhere from a reprimand all the way to disbarment and anything in between,” said Grogan, who could not speak on this specific case. \"\n\nAnd Petrus, as a reminder it was The Daily Beast. The reporter's name is Brandy Zadrozny if you want to flag her for being abusive and harassing you."
      },
      {
        "comment_id": "b81b4c0f-8419-4155-be6c-a33244ede0b2",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Mike, If this impending crash has the effect of reducing government, then great financial opportunity \nwill present itself for people to buy properties at prices less than the cost of the building material it would take to build them. But if government does not significantly shrink, it will continue to stifle business with over regulation and bleed the life out of businesses and citizens through all forms of taxes, user fees, and government revenue schemes. There will be no growing the economy after the reset of a crash if our huge per capita Gov. just continues to suck the life out of any possible economic growth. Small Gov. everybody wins if they invest during the crash. Big Gov. anybody who invests hard money even when properties are giveaway prices is foolish. It's too bad Gov. grew well funded and well manned for 40 years on big oil money. It has matured into something working Alaskans neither want nor can afford."
      },
      {
        "comment_id": "f77132bf-cc02-4d4d-a921-490267dca4db",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "To be fair, the DACA / DREAMERs were invited here.  But the reason they were invited was a breathtakingly cynical ploy by O'Bama to pump up the democrat voter rolls via chain migration.  Every single one of the 0.8 - 1.9 million DREAMERs will end up as an anchor for chain migration of their extended families, say 2.4 - 7.6 million additional illegals.\n\nYou don't have to deport anyone.  You have to shut down chain migration, anchor babies, and make sure that anyone in the country illegally has to leave and get back in line behind everyone who is doing it legally.  Legalizing these people is an insult to everyone following the law.\n\nIf it were me, I'd make sure none of these people can ever vote.  And I'd shut down all access to the welfare state, social security, and government paid health care.  Build the Wall.  Pass Tom Cotton's RAISE Act, and enforce existing immigration laws vigorously.  Cheers -"
      },
      {
        "comment_id": "d130ec04-b56c-4752-a581-4db6fcfacd3b",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Au contraire, awareness  in popular culture of Native American's existence will continue to be carried forward through gambling casinos."
      },
      {
        "comment_id": "748ff83a-27c3-4fbd-b74d-cdad5b0f4f40",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Federal government blocking social media users, deleting posts - cbc.ca\n\nCanadian government departments have quietly blocked nearly 22,000 Facebook and Twitter users, with Global Affairs Canada accounting for nearly 20,000 of the blocked accounts, CBC News has learned.\n\nMoreover, nearly 1,500 posts — a combination of official messages and comments from readers — have been deleted from various government social media accounts since January 2016.\n\n----------\n\nYup, diversity is our strength as long as you think like we do!!"
      },
      {
        "comment_id": "46fb642e-a3f2-42ad-beb8-e137bb3caf8e",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "Okay why is this person in the photo without gloves, and that's the weirdest picture I've seen from ADN."
      },
      {
        "comment_id": "4b6e5325-0077-4ccc-b3b1-c1e5518ff400",
        "author_id": "fa642b0b-96c4-4609-891b-39d8800dd8db",
        "user_id": "hillmelissa",
        "content": "False.\n\nLincoln's lengthy and enormously influential Cooper Union speech, which propelled him into the nomination and the presidency, was entirely about slavery and stopping its expansion in the western territories.  The South attacked Fort Sumter and seceded shortly after he was elected.\n\nIt is absurd to think that hundreds of thousands of men hurled themselves against one another for four years over the finer points of tariffs and \"states rights.\"  The Civil War was about eliminating slavery and stopping its expansion in the western territories."
      }
    ]
  },
  {
    "post_id": "dafa0e40-675f-4d9b-af18-6bdc43c62ed1",
    "post_title": "Cost seek table election among station prepare push.",
    "author_id": "770d29d8-41f6-432f-b1fe-b0066d1c6c4f",
    "user_id": "zgibson",
    "comments": [
      {
        "comment_id": "56f5f2ea-ee5d-4fee-a813-3c3ebb859738",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "You always present an interesting perspective.   This will give me something more to ponder on my way to Sturgis next week."
      },
      {
        "comment_id": "2e7491ab-d426-4920-907e-dc631140c092",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "And your proof is?"
      },
      {
        "comment_id": "397e9aa6-1243-4791-8fae-a9610cea1edc",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "The old battle-ax is gone.  I'm glad she lived long enough to witness a black president elected and too bad she died before witnessing Hillary take the oath come January.  Whoot, whoot!"
      },
      {
        "comment_id": "6ed6aba5-8927-4238-98b7-5aa08fddba99",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "Robin,\n\n  Be sensible. Conservatives need to support the least of the evils for leader and Canadians need to pray they do.\n  You don't want the Unthinkable Unimaginable Jason Kenney to be...gulp...the next...gulp ... Prime Minister of,,,gulp...Canada...!!? Do you!????"
      },
      {
        "comment_id": "196a409c-5b01-44b7-bccb-ce7994405c36",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "The public is fed up with Government Waste and wants government run like a business. It's ridiculous that hard-working Canadians with modest incomes can't afford to buy a home but are taxed so surplus employees can earn twice and much, take up to 100 days off per year and enjoy up to 13 weeks of vacation (ie the TTC, other governments levels too).\n\nThose on modest incomes lose 25% of their pay due to taxes, cpp and Ei. It's just not right to waste so much money while treating hard-working Canadians so poorly. The working poor, for example, cannot affford prescriptions, do not have benefits yet are forced to pay for Canada;s laughable $7K/person medicare program which delivers only $4,000 in value at best and no pharmacare. Cruel misgovernance and waste must end along with all convenient politically minded  spending.\n\nOverpaid excess emergency and hospital workers work 12-hour shifts for convenience, endangering the public and delivering poor quality error-riddled service when tired."
      },
      {
        "comment_id": "b7cca0a9-77f9-4b45-a76f-50995c06a0d6",
        "author_id": "314a276e-49cc-4f62-9a6d-2e29805397bc",
        "user_id": "ltaylor",
        "content": "Good point Janine, I didn't catch that. Chances are she didn't have a safe home and she left. When you're that young and feel like you don't have anywhere to go, then hanging out with \"older tough\" guys can seem like the perfect solution. You feel wanted, special, safe and you have a place to stay. At that age that can seem like love. Sounds like she got in over her head and is mixed up in an ugly situation. She's very involved as you said, she probably was very scared. Hopefully this will be her wake up call to change her life and get her shit together. When you don't have a safe home or on the streets, staying in school and being successful in school is extremely difficult. I wish her the best of luck. This \"thug\" wanna be gang lifestyle ends 2 ways, dead or in jail. They tend to die very young."
      },
      {
        "comment_id": "0551622e-1627-4f46-a22d-6e84450386f4",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "Paid agitators on both sides! Saul Alinksy, divide and conquer.  Robert Lee, never even owned a slave but Union General Grant did! White supremacists do not equal White Nationalism. Like La Raza & BLM right? \n\nDid you hear them? Saying \"you will not replace us!\", mass third world immigration on an industrial scale, but only in White nations! Muslim nations won't even take their own in , why? Too dangerous!\n\nStop the wars for the Greater project for Israel , where Barry dropped more bombs on the ME than GW\n\nWhy hasn't the media reported the biological terrorism by Antifa, throwing feces and urine at passers by?\n\nThe Trump is a racism doesn't hold water or he is a NAZI either.  Do you not know he is surrounded by Jews, both in his own family and in business.  Long time, famed NYC Lawyer, Cohen,  Not all Jews are of sabbatean variety or support the complete destruction of the white race.  \n\nI think Trump is getting closer to the John Pedo Podesta child trafficking ring, and the DNC"
      },
      {
        "comment_id": "ca603634-2bcd-46a7-87a3-6128180ac591",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "this comment is what happens when someone is using y0ur compassion against you\nno more buddy, we're wise to your scam"
      },
      {
        "comment_id": "ed037d89-1f5e-4ac7-b81c-44fdffb73f2f",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "Well, there a millionaires out there who need tax cuts!"
      },
      {
        "comment_id": "00b138b9-7cd1-45ff-88bc-17b0f559d409",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "He's someone who thinks you're pathetic."
      },
      {
        "comment_id": "2c1946da-f6ba-4bbd-ada3-64abd8278b01",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "It is not good, safe for the C. G. to have left the boat there this long. What did anyone expect? It is going to be a tourist spectacle and nighttime party boat for all. This accident is really a big embarrassment  for Hawaii now. What kind of government do we have here? A banana republic?"
      },
      {
        "comment_id": "7fd8114e-9ef4-42b1-8f89-f8562bc7481e",
        "author_id": "ea530834-be52-4a08-bb6a-c3d1e5a375b7",
        "user_id": "qyoder",
        "content": "Agreed.   The biggest question for the CBC crowd will be which colour will his socks be?"
      },
      {
        "comment_id": "22581b75-82f5-4754-bc2c-c979a9c444dd",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Nothing to see here folks, just a display of greed driven urban development."
      },
      {
        "comment_id": "d6e1ce77-33e1-4ded-854e-8a97d98d9e92",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "I loves me my religious satire"
      },
      {
        "comment_id": "6aee376b-1efa-43b4-bf36-85321cc56596",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "You might want to consider actually reading web sites before you link to them, because this one actually disproves your point.  As the site's name suggests, every NFL team cheats, and the Patriots are \"below average\" when it comes to cheating.  Last year's champions rank at the top of the list."
      },
      {
        "comment_id": "541e28f3-0392-460f-beb0-008394946d2e",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "So, maintaining a list of known Trump supporters seems frowned upon by the G&M moderators.\n\nThat's interesting.\n\nNot sure what their issue would be in maintaining a public list of those still supporting a pu**y grabbing, tax dodging, KKK endorsed US President-elect given the more flagrant violations of posting guidelines that are not being enforced here.\n\n\"Our goal at The Globe and Mail is to foster intelligent, insightful and entertaining conversations.\""
      },
      {
        "comment_id": "a92c8d51-c149-4291-bded-7078f48e56cd",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Monte,\n\nWhat was written into the Bill of Rights and how it is being interpreted by the advocates of \"social justice\" are worlds apart. You mentioned slavery and Jim Crow as if Conservatives wanted to re-impose them. That is pure rubbish. The most stalwart defenders of slavery through American history were Democrats, who later wrote Jim Crow laws to preserve what they could of it. They also fought to prevent passage of the 1964 Civil Rights Act. The claims you echoed are the classic Stalinist/Alinskyite (yes, I said Stalinist) tactic of accusing your opponent of doing what you are doing while claiming to be doing the opposite to mask what you are doing. Those people who attacked Trump supporters and protested against him during the election campaign were all paid by rich Liberals, who are today funding the \"not my president\" protests in different cities. So I wonder if you have any idea how truly evil the Liberalism you defend has become."
      },
      {
        "comment_id": "fec12487-0d06-447d-9dbd-134416983f41",
        "author_id": "840aee84-ae91-4adb-8b4f-4237df6cb815",
        "user_id": "morganwhite",
        "content": "Don't listen to the naysayers, Joe.\n\nYou're doin' God's work, fella!"
      }
    ]
  }
]